{
  "extractedText": [
    "IELTS Liz",
    "IELTS Preparation with Liz: Free IELTS Tips and Lessons, 2024",
    "<img alt='' src='https://secure.gravatar.com/avatar/a335fc6e564d91fa38f0b273e802ac83?s=125&#038;d=monsterid&#038;r=g' srcset='https://secure.gravatar.com/avatar/a335fc6e564d91fa38f0b273e802ac83?s=250&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-125 photo' height='125' width='125' decoding='async'/>Hi, I'm Liz. Welcome! Enjoy your IELTS journey to success!",
    "True False Not Given: IELTS Reading Practice Lessons",
    "Free practice reading for IELTS True False Not Given questions. IELTS reading TFNG questions come in both the Academic reading test and the General Training reading test. Below are 4 FREE practice lessons for IELTS TFNG questions. They are practice lessons for IELTS candidates and are aimed at helping people develop awareness and skills to successfully tackle these types of reading questions. Before you do reading practice, watch this Free Video Lesson about how to successfully tackle these questions: TFNG Tips Video",
    "Note: If you are confused about the answers to any questions below, please check the comments boxes where I have explained in detail.",
    "What are True, False, Not Given Questions?",
    "These are questions where you are required to decide whether the information in the question statement is true, false or not given based on what you read in the passage. A TRUE answer is one where the question statement matches the passage information. A FALSE answer is one where the question statement doesn’t match the information because it is incorrect or gives an opposite meaning. A NOT GIVEN answer is one where there isn’t enough information in the passage to decide if the statement is correct or not.",
    "Now try the reading passages below:",
    "TFNG Reading: Exercise 1",
    "<img decoding=\"async\" class=\"alignnone wp-image-6998\" src=\"https://ieltsliz.com/wp-content/uploads/2014/12/IELTS-Reading-TFNG-Questions-300x216.jpg\" alt=\"\" width=\"226\" height=\"163\" />",
    "Passage: The Thames Tunnel",
    "The Thames Tunnel was a tunnel built under the River Thames in London. It was the first subaqueous tunnel ever built and many people were so amazed that they exaggerated their description of it calling it the Eight Wonder of the World at the time it was opened. It was opened in 1843 to pedestrians only and people came from far and wide to see the marvel. The day it was first opened, it attracted five thousand people to enter the tunnel and walk its length of almost 400 metres. The Thames Tunnel was used by people from all classes. Most working class people used it for its functional use of crossing from one side of the river to the other as they went to work each day, while for the middle classes and upper classes, it was a tourist experience. In the age of sail and horse-drawn coaches, people voyaged a long way to visit the tunnel, but this was not enough to make the tunnel a financial success. It had cost over £500,000 to complete which in those days was a considerable amount of money. However, even though it attracted about 2 million people each year, each person only paid a penny to use it. The aim had been for the tunnel to be used by wheeled vehicles to transport cargo so that it could bring in a profit. But this failed and the tunnel eventually became nothing more than a tourist attraction selling souvenirs and a subaqueous pathway connecting either side of the river. walkway. However, in 1865, the tunnel became part of the London Underground railway system which continues to be its use today.",
    "Questions 1-8",
    "Are the following statements true, false or not given according to the information in the passage above?",
    "Answers",
    "Click below to reveal the answers.",
    "Note: This passage was created by IELTS Liz. Information for this passage was sourced from various websites: ikbrunel.org.uk, wiki, britcannica.com and other sources.",
    ".",
    "TFNG Reading: Exercise 2",
    "<img decoding=\"async\" class=\"alignnone size-medium wp-image-12895\" src=\"https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-True-False-Not-Given-Reading-300x196.jpg\" alt=\"\" width=\"300\" height=\"196\" srcset=\"https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-True-False-Not-Given-Reading-300x196.jpg 300w, https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-True-False-Not-Given-Reading-768x503.jpg 768w, https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-True-False-Not-Given-Reading.jpg 900w\" sizes=\"(max-width: 300px) 100vw, 300px\" />",
    "Passage: Pyramid Building",
    "The most famous pyramid is the Great Pyramid of Giza which is actually only one of over a hundred surviving pyramids. There is a long-standing question about how the pyramids were built given the lack of technology over 4,000 years ago but scientists are piecing together the puzzle. The blocks which make up the pyramids were hewn from quarries and then transported to the pyramids for construction. This was an incredible feat considering the distance that the raw materials had to travel and their enormous weight. The transportation of the materials was either by river using a boat or by land using a wooden sledge. Given the softness of the ground, the wheel would have been of little use had it been invented at that time. It is believed that the sand in front of the sledge was wet with water in order to facilitate the movement of the sledge and reduce friction. These sledges were pulled manually or sometimes by using beasts of burden depending on the ease at which the sledges could move over the ground. Interestingly, two thousand years after the pyramid building era of the Ancient Egyptians, the Romans moved stones using similar techniques at Baalbek. Once the blocks arrived at the pyramid construction site, it is thought they were moved into place using a ramp and pulley system.",
    "The Old Kingdom period in Ancient Egyptian history is also known as the pyramid building era. The Ancient Egyptians achieved the most remarkable feats of building work which have still not been surpassed, particularly given the primitive technology used to build them. There is nothing remotely mystical or magical about how the pyramids were built as is commonly thought. Further still, while popular belief is that the Great Pyramid was built using slave labour, this theory has since been debunked. The first building made in a pyramid shape is thought to be the Stepped Pyramid which consists of six steps placed on top of each other in a pyramid shape to create the world’s first superstructure. The credit to finally achieving a smooth sided pyramid goes to Imhotep, an architect commissioned by King Sneferu. The pyramids were not an instant achievement, but the achievement of trial and error.",
    "Questions 1-8",
    "Decide if the statements below are True, False or Not Given according to the information in the passage.",
    "Note: Photo by Les Anderson",
    "Answers",
    "Click below to reveal the answers:",
    "Note: This passage was created by IELTS Liz. Information for this passage was sourced from various websites: catchpenny..org, wiki, bbc.co.uk and other sources",
    ".",
    "TFNG Reading: Exercise 3",
    "<img decoding=\"async\" class=\"alignnone size-medium wp-image-12900\" src=\"https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-TFNG-Reading-250x300.jpg\" alt=\"\" width=\"250\" height=\"300\" srcset=\"https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-TFNG-Reading-250x300.jpg 250w, https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-TFNG-Reading-852x1024.jpg 852w, https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-TFNG-Reading-768x923.jpg 768w, https://ieltsliz.com/wp-content/uploads/2019/01/IELTS-TFNG-Reading.jpg 900w\" sizes=\"(max-width: 250px) 100vw, 250px\" />",
    "Passage: Beethoven",
    "Composer Ludwig van Beethoven was born on or near December 16, 1770, in Bonn, Germany. He is widely considered the greatest composer of all time. Sometime between the births of his two younger brothers, Beethoven’s father began teaching him music with an extraordinary rigour and brutality, which  affected him for the rest of his life. On a near daily basis, Beethoven was flogged, locked in the cellar and deprived of sleep for extra hours of practice. He studied the violin and clavier with his father as well as taking additional lessons from organists around town. Beethoven was a prodigiously talented musician from his earliest days and displayed flashes of the creative imagination that would eventually reach farther than any composer’s before or since.",
    "In 1804, Beethoven was completing his third symphony, which he at first named “Bonaparte” in honour of Napoleon. However, when later that year Napoleon proclaimed himself Emperor, Beethoven was so disappointed that he renamed his composition “Eroica”. This work, his greatest and most original to date, debuted in Vienna in 1805. It was so unlike anything heard before that through weeks of rehearsal, the musicians could not figure out how to play it. At the same time as he was composing these great and immortal works, Beethoven was trying hard to come to terms with a shocking and terrible fact, one that he tried desperately to conceal. He was going deaf. At the turn of the century, Beethoven struggled to make out the words spoken to him in conversation.",
    "Despite his extraordinary output of beautiful music, Beethoven was frequently miserable throughout his adult life. Beethoven died on March 26, 1827, at the age of 56.",
    "Notice: The passage above is from biography.com. You can read the full article on this page: Ludwig Van Beethoven. There is also a great video to watch about this composer.",
    "Questions 1 – 6",
    "Are the following statements True, False or Not Given according to the information in the passage.",
    "Answers",
    "Click below to reveal the answers.",
    ".",
    "TFNG Reading Exercise 4",
    "Passage: Spam Messaging",
    "SPAM, as every user of mobile phones in China is aware to their intense annoyance, is a roaring trade in China. Its delivery-men drive through residential neighbourhoods in “text-messaging cars”, with illegal but easy-to-buy gadgetry they use to hijack links between mobile-phone users and nearby communications masts. They then target the numbers they harvest, blasting them with spam text messages before driving away. Mobile-phone users usually see only the wearisome results: another sprinkling of spam messages offering deals on flats, investment advice and dodgy receipts for tax purposes.",
    "Chinese mobile-users get more spam text messages than their counterparts anywhere else in the world. They received slightly more than 300 billion of them in 2013, or close to one a day for each person using a mobile phone. Users in bigger markets like Beijing and Shanghai receive two a day, or more than 700 annually, accounting for perhaps one-fifth to one-third of all texts. Americans, by comparison, received an estimated 4.5 billion junk messages in 2011, or fewer than 20 per mobile-user for the year—out of a total of more than two trillion text messages sent.",
    "(Notice: Passage from The economist, November 2014)",
    "Questions 1-6",
    "Decide if the following questions are true, false or not given according to the information in the passage.",
    "Answers",
    "Click below to reveal the answers.",
    ".",
    "RECOMMENDED FOR YOU:",
    "FREE SUBSCRIBE",
    "Subscribe to get new lessons & tips by email.",
    "Email Address",
    "Subscribe",
    ".",
    "Comments",
    "Hello Mam. How the answer of the ques- 6 is true in the TFNG Reading: Exercise- 3? Here it is said in the early 1800’s…… and in the passage it is said at the turn of the century ….. which means when century is ending and a new one is beginning. The ans. should be false.",
    "“the turn of the century” refers to the years surrounding the end and beginning of a new century. For example: from about 1895 to 1905 is “the turn of the century” for the century starting 1900. The final years before and the first few years after. “the early 1800’s” means about 1800 to 1805 and this is part of the turn of the century which is bridging 1795 and 1805.",
    "Hi Liz!\ngreeting from Myanmar.\nI thought Beethoven’s passage No. 4 is TRUE because ‘in honour of and inspired ‘ are similar. It was so weird myself when I found out that other people thought that was false, while I was thinking as TRUE.",
    "Don’t worry. These are challenging words that overlap in some way but are very different. Let me give you an example so you can understand:",
    "Lets imagine I write some music. One day I was walking by a river and heard the sound of water. I got inspiration for that music from the water and wrote my music to reflect that water. I didn’t have a name for the music and I didn’t want to call it “water” even though the water was the inspiration. So, I called it after my friend – Marie – because she reminds me a little bit of water (a free-flowing person). The music was inspired by the sound of water and named Marie in honour of my friend.",
    "Sorry it’s a long illustration but I feel it’s the best way to illustrate the two words and their different meaning / uses.",
    "Hi, Liz\nGreetings\nP-1 Q-4,”For upper classes and middle classes, it was an tourist experience” isn’t it mean that they use it less?? So, shouldn’t it be F rather NG?",
    "This information is about why people used it, not how often. As middle classes could come from all over the world for a tourist experience, but only local working class people used it for normal crossing – it is impossible to guess numbers from information about why they used it. The passage must contain clear details that more people used it in one class than the other class for a False answer – not why they used it.",
    "Hello Liz, I have one doubt in TFNG READING EXERCISE 4 Q. No. 6. How is the answer as Not Given?? Please explain this. Thank you in advance",
    "The key is in the question “more texts than anywhere else in the world”. Does the passage compare the number of texts Americans sent to all other countries in the world?",
    "the passage stated “in comparison…”",
    "Those words were used but it doesn’t indicate the answer. Lets look at the previous sentence – it gives information about the number of texts received by users in Beijing and Shanghai.  This has two key points – 1)  it is about cities in China  2) it is about texts received. Yes, it uses the words “in comparison” but it is not comparing the same things that the question compared.",
    "The question is not about comparing two cities or even two countries. It says “more than anywhere else in the world”. This means – no other country sent more texts than America. The passage doesn’t compare America to all other countries – it only mentions cities in China.",
    "The other issue is that the question is about sending texts and the passage is about receiving texts.",
    "One problem people have with TFNG is that they distracted. You were correct to recognise that the question is a comparative sentence. But you got distracted because the passage used the words “in comparison” and that was the challenge – to see beyond those words and spot the difference between the passage and the question because of the finer detail. It’s all about the details.",
    "I hope this helps 🙂",
    "I had a trouble with this question. Thanks for the explanation Liz",
    "You’re welcome",
    "Hello Liz,\nWhich paragraph contains the following information?\nQuestion :  a recommendation for better regulation",
    "G.  This leaves rock climbing with an uncertain future. Climbers are not the only user group that wishes to enjoy the wilderness – hikers, mountain bikers and horseback riders visit the same areas, and more importantly, they are much better organised, with long-established lobby groups protecting their interests. With increased pressure on limited natural resources, it has been suggested that climbers put aside their differences over the ethics of various climbing techniques, and focus on the effect of their practices on the environment and their relationship with other users and landowners.",
    "H.  In any event, there can be no doubt that the era of the rock climber as a lone wolf or intrepid pioneer is over. Like many other forms of recreation, rock climbing has increasingly come under the fold of institutional efforts to curb dangerous behaviour and properly manage our natural environments. This may have spoiled the magic, but it has also made the sport safer and more sustainable, and governing bodies would do well to consider heightening such efforts in the future.",
    "I selected G as my answer, but the key card indicates that the correct answer is H.",
    "I think the problem here is with the word “better regulation”. This is about either better regulation from the government or from sports officials within that particular sport. It is something formal for bringing new rules and regulations to a sport that everyone must follow.",
    "The first paragraph (G) only refers to climbers not focusing on their own techniques and that they should think about the environment. That isn’t a recommendation for a new rule or regulation. It’s just a normal thing we might all recommend people to think about. But it’s easy to be misled by words such as “ethics” or “suggested”. But IELTS is not about matching words, it’s about matching deeper meaning.",
    "But paragraph H has key words that you must notice, such as “institutional efforts” – this means something formal in relation to dangerous behaviour and the environment. Then it also refers to “governing bodies” should push for this – that means it is a recommendation for a new regulation or rule from an official body. So, this paragraph is talking about how the sport of rocking climbing is encouraging better behaviour for rock climbers and that official bodies should enforce this (in other words, by making new regulations). This is very much a case of reading between the lines to get to the deeper meaning behind the words.",
    "Useful. Thanks Liz",
    "Hey Liz\nCan you elaborate more on Q4 of P1. My answer was FALSE as they given “most working class people used it”",
    "The statement means “more middle class/upper class used the tunnel” than working class. It is a comparative statement comparing how many people used the tunnel from different classes.\nThe passage doesn’t compare. It says most working class people used the tunnel for functional reasons. This means the majority (about 80%) of working class people used the tunnel in a practical way. That information is about why they used it. We still don’t know how many working class people used it only the reason they used it. The middle and upper classes used the tunnel for other reasons and again we don’t know the numbers of those classes either.\nSo, a) the passage doesn’t compare numbers of people from each class b) the passage is about the reasons they used it\nIt is important not to get lost matching words. But instead think – what information is the statement presenting. Then think what type of information is the passage stating.",
    "Hi Liz:\nThank you for your help in ielts preparation. I have a question, there are two following statements:\na) Before the exam started, the students were reminded to turn off their mobile phones.\nb) Prior to the commencement of the exam, the invigilator said that mobile phones need to be switched off.\nIs this true or not given?, because in statement a, no information about invigilator. The students may be reminded by someone other. It is not clear that they are reminded by invigilator or someone other. So, please help me to choose answer.",
    "The biggest mistake you are making here is that you don’t even state which statement belongs to the question and which sentence belongs to the passage. It is essential to know and to differentiate. You are not matching sentences. You are checking if the information in the statement exists in the passage or not, and whether that information is accurate or not. Without specifying which statement is the passage and which statement is the question means that you aren’t approaching TFNG questions in the right way and this will lead to confusion over the answer. So, unless you tell me which statement is which, I can’t give you the answer.",
    "Hello Liz!\nI hope you will be fine. my query is about Q-6 in passage-4 of spam messaging where in the statement, it is written that American sent more messages than other countries, but passage demonstrates that American receive messages of 4.5 billions in 2011. These are false statements in my point of view, but the correct answer is Not Given.Can you please help me out to explain this question",
    "FALSE means that the statement is wrong. It means that the information in the passage shows that the statement is wrong. The passage doesn’t give any information about how many texts Americans sent. No information at all. It also doesn’t compare the number of texts sent by Americans with the rest of the world. For the answer to be FALSE, the passage would have to show that another country in the world sent more texts than Americans did. That information doesn’t exist in the passage.",
    "I have same doubt, as information is contradicted. Passage demonstrates that American Receive this much messages in 2011 but question is about how much message they sent.",
    "A contradiction is when the information in the question is provided to be incorrect or opposite. You must be clear in your mind what this looks like. For example:\nQuestion = Americans sent more texts in 2011 than anywhere else in the world",
    "– A TRUE answer would be: this is correct, America did sent more texts that any other country in the world that year (the passage proves this)",
    "– A FALSE answer would be: this is wrong, there was another country that sent more texts than America that year (the passage proves that the information is incorrect)",
    "A NOT GIVEN answer would be: we don’t know if another country sent more texts than America because the passage doesn’t say for sure (no conclusive information to prove false or true).",
    "You always make sure the true, false and NG answers are clear in your mind before you look at the passage. Otherwise, you’ll get confused.",
    "Thank you Liz for the teachings so far, I was directed to you by a colleague who used your platform to practice and pass her IELTS at one sitting with band 8 and am hoping to smash mine too by next month…\n Please regarding this True/False /Not given question is an answer True only when the statement matches the passage, what if the Passage matches the statement is there difference in that. hoping to hear your response\nGoodnews\n22/05/2024",
    "A TRUE answer means you can find all the information given in the statement in the passage. It is not the other way round. It is important to approach these questions by first being very clear what the statement is saying, to analyse the statement. Only when you are very clear do you then look to find that information in the passage.",
    "Hey Liz,\nThank you so much for helping me. It is so nice to see that there are peple who are not greedy of money but helping others.\nI pray for your better health.",
    "Christina",
    "Thanks",
    "hi Liz thank you for help us . I have one question. At the turn of the century, Beethoven struggled to make out the words spoken to him in conversation doesn’t is mean in the early 1900’s or early 1800’s . I don’t understand true false not given passage 3 question number 6. I am confused by year .",
    "Always read around the answer. That means read the sentences before and after the key sentence. Beethoven died in 1827. So, “turn of the century” would relate to around the 1800’s.",
    "thats wonderful.. I was also confused wih this statement and marked Flase… I am going to sit for the Exam tomorrow.. wish me Luck",
    "Wishing you lots of luck!!",
    "Hi Liz,",
    "Thanks for your very useful material.",
    "Regarding question 3 for the passage about Beethoven, I think the answer should be NOT GIVEN.",
    "The passage says “On nearly daily basis, Beethoven was flogged, locked into the cellar and deprived of sleep for extra hours of practice.”",
    "The question says “Beethoven was denied hours of sleep as a punishment for poor performance.” From my understanding, the information “as a punishment for poor performance” is not mentioned in the passage, and it does not contradict the information in the passage, either.  Why did he need extra hours of practice? No one could know from this reading. Therefore, this statement is NOT GIVEN, I think.",
    "But perhaps, my interpretation was wrong, and I’m looking forwards to your instruction.",
    "Spend more time analysing the question statement. The statement gives a reason for sleep deprivation. The reason is “poor performance”. The passage shows this is not true because the reason was “for extra hours practice.” Always look deeper at the meaning in the question.",
    "Hi Liz,",
    "I wanted to express my sincere gratitude for the guidance your videos provided during my recent preparation. I had only 5 days to prepare and your videos, particularly the exercises on this site was instrumental. I could achieve 7.5 overall score in my first attempt. Thank you helping students like myself succeed in their endeavors. Honestly, I do not write reviews/feedbacks  but I personally felt you truly deserve one. Finally, I was saddened to hear that you are currently unwell. Wishing you a speedy recovery. Once again, “A Big Thank You” .",
    "Thank you for your lovely message. I’m so pleased to hear you did well. Band 7.5 overall is a great result. Very well done to you 🙂 Thanks for your wishes for my health. I appreciate your support. I hope to have a personal update video ready shortly so I can let everyone know how I am. Wishing you all the best for your future, Liz",
    "In beethoven passage first one , we exactly known the day/month/year ,even birth place (perhaps we dont know time) that exactly we dont know about it",
    "how could it be true?",
    "I understand your concern. First, lets focus on the question. It is about when he was born, not where. So, forget the information about where he was born. We are focusing on a date only. The question is about this statement “It is not known exactly when Beethoven was born.”. There is a keyword in the question which is “exactly”. You need to highlight that word in your mind.\nThen you go the passage and read “Beethoven was born on or near December 16, 1770”. You need to look at the language, not just the date. The language includes “on or near”. What does that mean? It means that the date is not known precisely – it could be that date but it also could be another date – it isn’t known for sure.\nNow that you have analysed the question and the passage, you have your answer. It is true – it is not known when exactly. A precise date is simply that date and it can’t be another date. It requires a logical approach and paying attention to keywords and paraphrases.",
    "Dear Liz,",
    "Thank you for your platform as it has been helping me study for my upcoming IELTS.",
    "I have an observation regarding the Reading Exercise 4, Question 4.",
    "In the question, it states: “In 2013, the number of SPAM texts increased considerably to reach at least 300 billion.”",
    "The key phrase here is “AT LEAST,” indicating that the number was lower before but has increased, possibly surpassing 300 billion.",
    "Upon reviewing the passage, it mentions: “They received slightly more than 300 billion of them in 2013.”",
    "The emphasis is on “Slightly More,” suggesting that the number is not less than 300 billion but exceeds it.",
    "Considering this, I believe the answer to Question 4 should be TRUE because both the question and the passage indicate that the number is not less than 300 billion but potentially higher.",
    "Thank you for your feedback on this matter.",
    "Sincerely,\nJerry Jacob",
    "The words “at least” do not indicate anything to do with change or anything to do with a previous number. And this is what the question is testing. It’s testing your ability to understand language of change. The term “at least 300 billion” means “300 billion or more“. It means the number was either 300 billion or just over 300 billion, such as 305 billion or 315 billion, but because the writer doesn’t know the precise number, they give an estimated number with a guarantee it is not less. It only shows what the number was in 2013 (300 billion or just over 300 billion), and doesn’t relate in any way at all to change from a previous year. It doesn’t relate to increase or decrease at all. So, the problem here is your misunderstanding of “at least” and what we mean by this expression.",
    "Here’s an example so you can understand the words “at least“. “The woman speaks at least three languages“. This is the same as “The woman speaks three languages or maybe four languages. I’m not sure precisely how many – but I am sure it is not less than three languages“. It shows nothing of change, and only talks about a static fixed number which is not precise.",
    "You can use this expressions for many things when you are not sure of the precise number. You could say “the woman has at least two cars“, this means you’ve seen two cars so you are positive she has two, but you also think there might be another car, but you are not completely sure if it is two or three cars. You can use this expression about age “she is at least 50 years old” = “She is definitely not under 50 years old, she might be 50 precisely or just over 50 years old, I’m not sure“. So, this is all about language of imprecise numbers and nothing about change over time.",
    "hi liz I have a question, so I was practicing with the link you put and I encountered a mix up. the question” Casual workers may be hired by the hour or by the day. the passage says” Casual employees are employed on an hourly or daily basis.” I picked false cause the question says may, but the answer on the site says true. kindly clarify thank you.",
    "The word “may” has two different meanings. 1) may = might = possibility  2) may = can = a formal use of the word. This has the meaning is the same as “employees are employed” in this context when referring to how people are employed by a company. For example, employees may bring their own food or eat in the restaurant = employees can bring their own food or eat in the restaurant = employees eat their own food or eat in the restaurant. Remember, meaning is all about context.",
    "Hello Liz,",
    "I practiced for around 1 month and I always referred to your instructions. It was difficult because I’m working in a 8-4 job.\nHowever, I managed to score 9 for reading and the credit goes to you. I wouldn’t have got that result without your learning materials.\nThank you very much!",
    "Band 9 is amazing!! Hats off to you!! I’m really impressed you got this score while also holding down a full time job. It’s really encouraging for everyone preparing for their test. Thanks for coming back to share your result with us all 🙂",
    "Hello kish\nIn 7 weeks time I’m writing the test, but time constraints is my biggest concern. any idea that can help me please",
    "Hai Liz\nI have a small doubt in Reading Exercise 3 Question number 5. The given answer for that particular question is Not Given. My doubt is in 2 paragraph of the given passage in 3rd line it’s stated that “most original work to date”, then can that be considered as he is not inspired by any person and then there is possibility for the answer to be FALSE.\nI would like to thank you for the efforts you are putting into this. I learned lot from your videos and teachings.",
    "For the answer to be false, it would need to state that his original work was inspired by a person who isn’t famous, a feeling, a sound or something else, but not inspired by a famous person. That would give you a false answer. However, the passage does not state what his inspiration was at all, which is why it is NG.\nNearly all original works, such as for music, art etc, will have inspiration behind them. Just because it is original, doesn’t mean there isn’t inspiration behind it. The inspiration for a painting might be the sound of water, a scream, a person – it is an idea or a feel which the artist feels inside him or her to create the piece of work.\nYour problem comes because you are confusing inspiration with original. Most original words have inspiration behind them. Please review your understanding of inspiration. Then research examples of the different inspirations that original works around the world have, so that you really understanding the meaning.\nI’ve added more information to the answer key about the problems with the vocabulary in this question so that other people don’t struggle so much.",
    "Hi Liz,\nI want to ask about Beethoven passage for question 3. I answered FALSE since the question mentioned “poor performance” and from the passage we can see that “Beethoven deprived of sleep for extra hours for practice”. In my opinion, poor performance have a different meaning with the need for him to practice for extra hours(?) The meaning contradicts with the sentence in the question.",
    "I want to thank you for making IELTS explanations and practice for us which is really helping me out. I learned a lot from you. Thank you.",
    "I’m not completely sure what your concern is. You chose the answer FALSE and the answer is FALSE. Are you concerned about something?",
    "He was deprived sleep, ‘not as punishment’, but for ‘extra practice’.",
    "hi liz, I read you are seriously ill. I hope you get back well so soon.\non bethoven’s passage for question number 6. how is the answer true? it did mention he was getting deaf nearly but did not mention the year. so, how is that true?",
    "Thank you!",
    "I’ve added some extra information to the answer keys on the above page to help people understand the answers. Please take a look. Thanks for your best wishes for my health",
    "Hi Liz, this is regarding passage 3 and it’s question number 4. Can’t  it be taken as TRUE.??\nThank you..!",
    "The passage states that his father taught his two musical instruments, but it doesn’t say anything about him being a talented musician. There is a difference between being a teacher and being a talented teacher.",
    "paragraph first question 3rd.\nthe word used in the passage  “came” people came from far…..\nI’m little bit confused.\nI would be thankful if you explain it again.",
    "“people came from far and wide” = “people came from distant places”. “far and wide” is an expression in English.",
    "arent there any reading lesson videos on your YouTube channel?",
    "Yes, there’s a video lesson for TFNG reading questions.",
    "only one? Was looking for if there are more on Matching heading and other type of questions?",
    "I stopped making videos 8 years ago when I became seriously ill. I’ll make more videos when my health is more stable.",
    "Oh! I’m sorry to hear this. I hope you you get well soon and enrich students with your knowledge. Thank you for your quick responses though. God bless you!",
    "Thanks",
    "Get well soon.\nThanks for everything.",
    "Dear mam, we hope you feel better soon. Your kind students are eagerly waiting for your new videos.",
    "Thanks",
    "Hello mam,\nI am struggling to achieve a good score in the reading module, consistently scoring between 10 and 15. During my practice sessions, I find myself easily distracted and feeling sleepy. I’m unsure where to begin and end during the reading module, and despite practicing for two months, I feel like I’m struggling in every aspect. I apologize for sharing my concerns, but I’m hoping you can assist me. In my practice, I find that I’m only able to complete two passages within 2:30 hours, and this is causing significant disappointment. My highest score in reading has been 23, achieved only once. I am looking for strategies to improve my performance. Can you please guide me on where to start and end in the reading module and suggest strategies that may help me overcome these challenges?\nThank you",
    "Sounds like you have a bit of burn out. If you are doing one full practice test, then another and then another and then another etc etc. You will be exhausted, your concentration will drop and you are not likely to improve. That’s why I created this website. The aim is not to do one exercise after another for reading. But to do one, analyse your errors, make a note of why you got one question right and the other wrong, to make a note of paraphrases and start becoming aware of strategies. This is what development is about. You don’t get that through constant practice of full tests, but through analysis, focusing only on a few questions or a particular question type, not an entire test. You need to alternate between development, analysis, paraphrasing work and actual full test practice. And when you do a full test practice you spend an hour or more analysing it again, developing, making notes, focusing on your issues etc This way your speed will eventually improve as you develop.\nThere is a reason why teachers don’t teach by making students do three practice tests in one day. You need variety in your learning, you need to focus on different skills, youo need to practice question types rather than only full test etc. You only do one full practice test after a period of developmental work. Then you return to developmental work before trying another.",
    "Hello Liz!\nI had some confusion regarding the passage 3, question no. 5\nYou gave an explanation for the answer NOT GIVEN but I marked it FALSE while doing it myself as in my point of view, it is said in the passage “It was his grandest and most original work to date”. Taking that line as a reference I answered FALSE as it means he made it himself, not inspired by anyone else. So, would that still be correct?",
    "You have confused the meaning of “to be inspired by someone”. You seem to think an original work cannot be inspired by a person. This is wrong and is a misunderstanding of the word “inspire”.\nAn original work means that no one has done it before – it is unique. Inspiration is an imagination to create something original that comes from a thing or a person. An original work could be inspired by the sound of water – it is still original work. An original work could be inspired by a person, such as their face or their character. It means you have that person in your mind when you create your original work. An artist might possibly see a beautiful woman walking on the street one day and watch how she walks, maybe she walks like a floating flower – this becomes the inspiration for their original work – their creative idea that forms the basis of their original work. IELTS tests are designed to test your ability to distinguish words and meaning. This particular question is high band score.\nTo sum up, an inspiration for a work is something in your mind that shapes and forms your original work, such as the sound of water or the idea of a person. All original works are inspired by something, whether it be a person or a thing or a feeling.\nIf you still struggle with the difference in meaning between these words, please check a large dictionary that can describe in more detail.",
    "hello liz,\ni have doubt reagrading passage (4)\nquestion (4) that less than 300 billion was given in the question\nbut in the passage they mentioned more than 300 billion\nso, i thought the statement was flase but the correct answer was not given\ncan you please explain it\nthnak you",
    "This is because you are only looking at numbers. Your task is to analyse the entire statement, not just a part of it. The statement is about whether the number increased and this means increased from previously – in the past. The words increase and decrease are opposites and are used to describe change over a period of time. The passage only shows numbers for one year, not for any previous date in the past. This is the type of thing IELTS will test you on.",
    "Hi mam,\nI’m confused about Passage 1 question no 8. In my point of view, the answer is Not Given but the actual answer is True. How is it true? Can you explain?",
    "The sentence “the tunnel became part of the London Underground railway system which continues to be its use today” shows that the tunnel is now used as part of the railway system and its use is connected to that. If something is used as a railway, it implies that it isn’t used as a walkway anymore. Remember, your aim is to discover meaning, not to match words. If a building is used as part of a shopping mall, this implies the building no longer used as a domestic residence – it’s the same thing in this passage.",
    "I was going thru the comments to see if anyone had raised “concern” to this specific point. Now I get it (I get the analysis). Thank you, Liz!\nFinding your website and video is what made my day so far.\nI hope you find encouragement too in reading my comment.\nGood health for us.",
    "I’m so pleased you’re enjoying my website and lessons. That makes my day 🙂",
    "Dear Liz, thank u for the help. There will be around 13 questions from one reading section, right? Can we be 100% sure that all the 13 or 14 questions will be in order? I mean, will we have to go back to the beginning or middle to get the answer of the final questions? Please clarify\nThank u in advance",
    "Each question type is different. For example, TFNG questions have answers that come in order. Matching headings questions do not. You need to know the question types and be familiar with the techniques for all of them. See this page: https://ieltsliz.com/ielts-reading-lessons-information-and-tips/",
    "Do these passages and type of questions hold the current standards of IELTS reading test?",
    "As the title of this page shows, they are practice lessons from a teacher to people preparing for their IELTS test. You still need to use authentic IELTS test materials published by IELTS for your preparation. But authentic tests are costly and answers are not explained which is why I create free practice lessons.",
    "Hi LIZ! thank you for your very useful tipls",
    "Please can you assist?",
    "This is a passage from IELTS practice test 2 :",
    "Though Davis’ trumpet playing may have sounded effortless and breezy, this ease rarely carried over into the rest of his life.",
    "Davis’ personal troubles had a negative effect on his trumpet playing. = NOT GIVEN",
    "why is this answered as NG, not a NO? Can you please clarify?",
    "The passage states that his effortless, easy playing did not reflect his person life (reflect, not impact). This means his playing was easy, but his life did not follow the same pattern. The two are not connected – one did not affect the other. They are only compared because they were opposite trends in his life. His playing didn’t impact his life and his life did not impact his playing. It is only compared that one was easy and the other was not easy. For example: if I am happy in my work, but my family life is not happy – the two are not connected by this statement. So, in English I could say “the happiness in which I work does not carry over into my personal life” which means happiness in one area does not mean happiness in another area because one is not related to the other – they are separate and not connected by cause or effect.",
    "Therefore, the statement is all about his personal life affecting his playing, but the passage doesn’t not show any connection between them – one did not cause or affect the other – they are simply unconnected opposites in his life.",
    "I hope this helps. It’s a very challenging question.",
    "Thank you so much! Understood!!",
    "Hi dear Liz, I hope you be doing well.\nflirt of all, thanks for any thing you learn to us, persons like you are barely found in the world so take care of yourself and l believe all of these kindness one day back in to your life and you will find your health again.\nyour explanation always clarify the problem for me, thanks again, I live you so much and I respect you a lot.\nkind regards,",
    "Zahra from Iran",
    "Thanks for your kind words",
    "Hello Liz,\nReaading : Passge 3 ( Bethoven)\nQuestion 3: The Answer could be Not given as well,because it dosent mention why was Beethoven denied hours of sleep , the paragraph only mentions he was denied sleep for extra hours needed to learn music",
    "Question  5:  The paragraph mentions Beethoven debuted his Symphony No. 3 in Napolean’s honour. So here if Napolean is an emperor, he is a famous man\nHence the answer can also be True",
    "The word “for” in the sentence “… denied sleep for extra hours of practice” is a paraphrase for the word “because of”. This means the reason he was denied sleep was because he was made to practice more and more.\nFor the your second concern, you need to look at the difference between the words “in honour of” and “inspired by”. These are completely different words with completely different meanings. They are not connected. I could say nature inspired my music and I first played it in honour of my father. What you are inspired by is not connected with who you first play it for as an honour.\nThese questions are testing high level English.",
    "Hi Liz,\nI have a little bit confusion about passage 3, Beethoven. Can you please explain question no. 6? Are early eighteen century and turn the century considerably same?\nAnd also for question no. 5 ,shouldn’t the answer be False? If not why. Sorry I am having trouble understanding these two.",
    "The turn of a century means the few years before and after the century changes. So, turn of the century for the 1900’s is around 1895 and 1905 – more or less. It isn’t a specific date – it is around that period.",
    "Hi Liz,",
    "Since the question states ‘in the early 1800’s’, shouldn’t the answer be False because he started losing his ability to make out conversations around 1895-1905 (turn of the century)?",
    "In this passage, “turn of the century” refers to the years spanning 1800, which means the years just before and just after 1800. It does not refer to around 1900 because Beethoven would have been dead nearly 80 years at that time. “turn of the century” is a relative expression and you must understand it in context. The paragraph with this information shows the date of 1804, so that date will act as your point of reference. It certainly doesn’t refer to the years around 1900’s because Beethoven would have been dead almost 75 years at that time.\nIf you mean, turn of the century refers to the years just before and just after 1800 – you are right. 1804 is included in that time period. A false answer would be a date that is not included in those years, such as 1850 (this would not be at the turn of the century).",
    "Hello liz, i wish to copy and print your reading exercises to familiarize myself with the paper format but the system is not allowing me, how do i go about it?",
    "Unfortunately, all my lessons are for use online and cannot be removed or copied.",
    "I’m a little confused about the question one under the Beethoven. In the passage it was stated that he was born on or near December 16, 1770. “OR” means you can either be born on or near right. I choose False which was incorrect. Can you please explain further?",
    "If a writer writes “on or near (a date)”, it means that the precise date is not known 100%. It means the date is a guess.",
    "Hi Liz, thanks a lot for your effort!\nI didn’t get the question about the attempts needed to get the pyramid construction right. In the pyramid building passage. What does it mean by trial and error?",
    "By “trial and error” is when you learn or do something by trying (trial) and making mistakes (error), which you learn from.",
    "Hey Liz, I just wanted to thank you for the free IELTS content on this website. I recently gave the test and got band 8. Thank you so much. And I hope you recover from your illness and get back to making new videos to help more people.",
    "That’s great news! Very well done to you 🙂",
    "im confused in passage 2 and que no 6 it says ”MANY PEOPLE BELIEVE THAT MAGIC MAY HAVE BEEN USED TO BUILD THE PYRAMID” but in statement its saying ”THERE IS NOTHING REMOTELY MYSTICAL OR MAGICAL ABOUT HOW PYRAMID WERE BUILT AS IS COMMONLY THOUGHT” I  think answer should be FALSE because the wording in que says MAGIC MAY HAVE BEEN USED it’s not confirmed that MAGIC WAS USED OR NOT USED there is contradiction in both statement and que and in passage statement its says ”THERE IS NOTHING REMOTELY MYSTICAL OR MAGICAL”",
    "You have missed the keywords in the passage “as is commonly thought”. This means most people do believe magic was used, but the writer is saying it is not true. This means it agrees with the state that most people still believe it, even though scientists say it isn’t true. This means you need to spot the difference between what most people think and what a writer thinks. This is a high level English question that only band 8 or 9 might get right. It is testing your ability to understanding “as is commonly thought” in a state that is stating the opposite.",
    "Hi Liz,",
    "Firstly thanks for your really wonderful session, free tutorials and practice sessions.\nI kindly need your assistance for passage SPAM MESSAGING question number 4 as per my understanding in the passage it mentions more than 300 billion which indirectly is an increase whereas in the question it states atleast 300 billion I believe the statement is false which I am wrong please can you help me understand better here so I can be precise on this as I am not able to understand from the answer provided.",
    "“more than 300 billion” does NOT mean an increase. It is a fixed number. If I said the number of messages was just over 5, does it show whether it went up or down? No, it only presented a fixed number of around 6, 7 or 8. We don’t know what it was before and that information is required to know whether there was an increase or not.",
    "Hello ma’am.\nBut in question 4 we have find out that is T/F/Ng  .In that paragraph they mentioned slightly more than 300 .Our question is reach atleast 300 .In my perspective answer will be False.\nIf I am wrong could you please explain me ?",
    "The key word is “increased”. Did the number change from the year before?",
    "I just started watching your lessons and I am left speechless not knowing how to describe the magnificent way of explaining and delivering the information.",
    "keep up the great job",
    "Glad you enjoy the lessons 🙂",
    "Hi Liz,",
    "Could you please explain the question number 3 in the passage about Beethoven. He was deprived of sleep because of extra practice as indicated in the text but it did not say that he could not be deprived of sleep because of poor performance. What if he needed extra practice because of his poor performance, which lead to his being denied of sleep. Poor performance was a new information on mentioned at all in the text. Should this answer be Not given?",
    "Your answers should be based on the information in the passage, not on speculations about what might be possible in other situations. The passage states clearly why he was deprived of sleep. You should not be guessing other reasons why he might be deprived of sleep.",
    "Hey Liz,\nyou said “The passage states clearly why he was deprived of sleep”?? where is it?\nIt is only mentioned “”  for extra hours of practice”” is the reason??\nthanks.",
    "That is correct. He father wanted him to practice more and more hours so he prevented his son from sleeping.",
    "Hey Liz,\nI had a doubt in exercise 2 question 2. Isn’t lubricating means using oil but in the passage use of water is mentioned. So should the answer be true or false?",
    "This issue here is your understanding of the word “lubricating”. This word does not actually mean using oil. It means using any substance which allows something to work more easily by preventing sticking or rubbing – basically a lubricant reduces friction. The most common lubricant is oil – but this is only one example. Water can be used to reduce friction and can be used as a lubricant. Soap can be used as a lubricant. Even compressed air can be used a lubricant. IELTS is all about distinguishing people who know the difference in the main meaning of a word and wider uses of a word.",
    "Thanks Liz",
    "Hi Liz, I have a question concerning the answer for Number 8 in the first passage. The answer says its “True” because the passage mentions its still being used as an underground passage, I believe its “Not given” because the passage mentions its use for an underground railway system and not for pedestrian use. Please can you clarify. Thank you",
    "Your aim is not to match words but to understand meaning. If the function of the tunnel changes from a walkway to a railway, this means it is not longer used as a walkway. A walkway and a railway are two different functions. This isn’t about imagining if people also could walk on the railway – if that was the case, the passage would have stated that. So, from the information given in the passage, the tunnel is now a railway and no longer a walkway.",
    "Hi Liz, I marked the 5th question of the 3rd passage false, as the meanings of “inspired” and “in someone’s honour” are not the same. So, he dedicated the No.3 to Napoleon, he was not inspired by him. Can you explain that, please? I am confused why we took Not Given as the right answer.",
    "It is possible to be inspired by someone and also dedicate something in their honour. The passage does give information about what or who the inspiration was.",
    "Hi Liz,\n Thank you so much for all you do, your lessons have been helpful.\nHope your health is getting better?",
    "I want to know if replying with “True” and “False”instead of “Yes”and “No” is permitted.",
    "No, it isn’t allowed. You must write the correct word.",
    "Hi Liz, I have my doubts regarding the same. the passage says it was his “original work to date” My understanding of original work is without seeking any inspiration. Is it true that inspired work can be stated as original work? and are they not necessarily co-related?",
    "“original work” means work that hasn’t been done before by anyone else (it is original) and does not relate to inspiration. Charles Dickens and Jane Austin wrote original works but we don’t necessarily know their inspiration. The inspiration means the spirit inside a person – what is driving them – what is motivating them. So, original work is 100% different from the source of inspiration, unless stated otherwise.",
    "Hi Liz, hope you are doing well.\nI have same query. you have mentioned that inspired and original are not the same. So its contradicting the statement, hence the answer should be false(in my opinion).I am still confused as to how the answer is “not given”.",
    "Just because A and B are not the same, does not mean they are opposites or that they contradict each other. We do not know what the inspiration was because the passage doesn’t give that information.",
    "Hi Liz, In the 4th passage the forth question is true but you given it as Not given. I didn’t understand why because, the information in the question matches exactly as it is in the passage,",
    "So many people struggle with this question.\nQuestion: In 2013, the number of SPAM texts increased considerably to reach 300 billion.\nPassage: Chinese mobile-users get more spam text messages than their counterparts anywhere else in the world. They received more than 300 billion of them in 2013\nWhat you have done is match the numbers. You’ve seen the words “spam messages” and the number “300 billion”. But you haven’t tackled the actual meaning of the statement.\nThe statement says the number “increased”. This means the number was lower before and then went up. Does the passage give any information about the previous number of messages and whether the 300 billion was an increase or a decrease? That is the information you are looking for. Based on that, do you think it is NG, F or T?",
    "Sorry Liz, I just wanted to note that in the passage it is stated that Chinese mobile-users received “more than 300 billion spam messages”. The question states that there was an increase in the number of spa messages to reach 300 billion. This implies that the number of messages received in total in 2013 was 300 billion. Contrary to the question, it is stated in the passage that spam received was over 300 billion. Doesn’t this automatically make the question false?\nI hope my question is clear.",
    "I think you are slightly mixed up between “increase” and “over”. The words “over 300 billion” is a static number. This means we don’t know if it changed or not from previous years. The number 350 billion is “over 300 billion”. The number 300 billion and one hundred is “over 300 billion”. So this passage only talks about a number in that year. It does not show an increase or a decrease from previous years. This really is testing your understanding of numbers and how we express change over time. If the passage had stated “the number of spam messages REACHED over 300 billion..” then the word “reach” means increase”. If the passage had stated “the number of spam messages dropped to over 300 billion”, we would see a decrease. But the passage doesn’t say anything like that. It only gives a number for one year (2013 = over 300 billion) – not up or down from before.",
    "Hi Liz,\nThanks for the feedback. While that’s true, the passage says “They received MORE than 300 billion of them…”\nThe statement was “increased considerably to reach 300 billion”",
    "I’d marked this statement as false, since the statement caps the number of texts received at 300B, while the passage says that the people received over 300B messages in 2013. I thought that was a clear contradiction.",
    "Could you help me understand why this is Not given?",
    "I feel I have answered this many time on this page. Please read the other comments. But to give a quick answer, the passage doesn’t given information about whether the number increased from previous years or decreased from previous years.",
    "thank you so much Liz. I think I understand my problem.",
    "Hi Liz Mam, Hope you are doing well.\nIn Passage 1, question 8) The tunnel is no longer used as a pedestrian walkway to cross the river.\nAns) Is mentioned as True,  with explanation –  In 1865, the tunnel became part of London Underground system which continues to be of use today.\nI couldn’t understand why its True, since the question mentions if the tunnel is being used as a pedestrian walkway now, but the passage says its being used for Railways.  It’s not mentioned if it is used as a walkway. Could you please explain if the answer will the answer be Not Given?",
    "The passage shows that it is used as an Underground Railway. An Underground Railway is not a walkway, it is an underground railway. For example, if the question says “The building is no longer used as a school” and the passage states, the building is now used as a shopping mal – we can see that the question is true. The function has changed – it is no longer the same.",
    "But it doesn’t say in the passage that it was used as a pedestrian walkway. I’m confused.",
    "This where you will find the information: “the first subaqueous tunnel ever built ……. It was opened in 1843 to pedestrians only”.\nTry not to look for specific words and instead aim for meaning. It was a tunnel used by pedestrians (someone walking, not using a vehicle) and this means it’s a walkway for people. So, we don’t see the word “walkway” because the passage uses the word “pedestrians” instead which gives the same meaning in the context of this passage.",
    "but now here the school building purpose is not mentioned. it just said that it’s no longer used as a school no information on how it is being used. please, clarify.",
    "In the example, I gave a few comment previously:",
    "For example, if the question says “The building is no longer used as a school” and the passage states, “the building is now used as a shopping mall” – we can see that the question is true. The function has changed – it is no longer the same.",
    "I stated “the building was used as a school”. The preposition “as” in this case indicates the purpose (which means its function).",
    "The building is used as a shopping mall – it’s function is now a shopping mall – this shows how it is being used.",
    "Grammar can be very useful to understanding meaning. So, pay close attention to it.",
    "Thank you for your prompt response. I understand that AS is defining its functionality. I need to understand that what if extra info is being stated in question and not in the passage what would be the answer then? Like here its not stated as its being used AS a shopping mall. Plz guide.",
    "I understand you now. My comment previously given about this was just a simple comment about language, not an example of an IELTS reading passage. The person leaving the comment didn’t understand the connection between the two sentences, which were in imitations of Reading Passage 1 above about The Thames Tunnel. Always be careful reading threads of conversations because it’s easy to get confused about what we are referring to. So, my comment wasn’t a separate lesson about TFNG, it was just a language point. However, below I illustrate in more detail so that no one else gets confused:",
    "Passage: The building was built around the 1890’s when it was used as a school. It was a popular school for the children of privileged families who had the means to pay for their education. A number of well-known politicians and leaders in other sectors of society were known to have been educated in that school. It’s reputation even spread to the continent as well. However, as more and more state schools were built, it’s renown gradually faded away. In the late 1950’s the magnificent building, which was a wonderful example of Victorian architecture, became part of a chain of stores. It is now used as a shopping mall.",
    "TFNG Question: The building no longer serves its role in education.",
    "This would be a TRUE answer. The building is not involved in education anymore because its primary function has changed from a school to a shopping mall. When we write “the building was used as X” – the preposition “as” relates to its function and the whole sentence is implying its main (only) function. So, therefore, its function has changed making the question TRUE.",
    "I think if this is rephrased thus, “Did the number of SPAM texts increase to 300 billion in 2013?”,  the answer is obviously TRUE because it did get to 300bn in 2013. There is no disputing that in 2013, the spam texts got to 300 billion.",
    "We do not know if it increased or decreased because we don’t know the figure from the previous year. If in 2012, the number was 200 billion, then it increased and the answer is true. If in 2012, it was 400 billion, then the number decreased. This is all about meaning – did it increase or decrease from previous years. This is not a statement asking about a static number but about whether the number changed from before. This is why you shouldn’t be matching numbers but trying to decipher meaning.",
    "hello mam,\ni have doubt in passage 2 -4th question\nin passage 2 it is clearly given that “interestingly 2 thousand years after the pyramid building era of the ancient Egyptians , the romans moved stones using similar techniques at Baalbek”.\nquestion is “the romans learned the techniques of moving huge stones from the Ancient Egyptians.\nso the answer is “true”.\nbut in answers it is “not given”.\nso mam can u please tell me why the answer is “not given” .",
    "Just because they used similar techniques, it doesn’t show how or where they learned those techniques from. So, the passage is only about using techniques, but the statement is about the location of learning. Those are two different unrelated things.",
    "Why are you not uploading videos on YouTube please come back we all miss you….",
    "This is because I have a serious long term illness. When my health is stronger and more stable, I’ll make more videos. However, I don’t know when that will be.",
    "Wish you a swift recovery, Liz. I have benefited quite a lot from all of your free lessons. You are a great teacher.",
    "Thanks",
    "Praying for your Recovery",
    "Get well soon. God bless",
    "Thanks",
    "Get well soon Liz. Praying for your quick recovery. We love you.",
    "Thanks",
    "oh! so sorry to hear. My prayers are with you and I believe it will be answered.  You’ve been a blessing to so many and it will gladden my heart if you get back to your feet and defeat your fears.",
    "I love and appreciate your works Liz. Thanks for being such a blessing to this generation.",
    "Praying for your speedy recovery, take care <3",
    "Thanks",
    "❤️ Stay strong",
    "Thanks",
    "May God grant you a quick recovery, and strengthen you to carry on, and May God grant you a longer life, in good health and wealth. I am new here, a new follower, who’s found your page very helpful, and for this, I am deeply grateful to you.",
    "Thanks",
    "You are such a sweet person. Doing so much for the students selflessly. All good people are to pass tests given by God. Wish you lots of love, good health and happiness.",
    "Thank you for everything.",
    "Thanks. That’s really kind.",
    "Get well soon. Praying for your quick recovery. May God strengthen you.",
    "Thanks",
    "I Pray for your health liz. You helped me a lot",
    "TAKE CARE OF YOUR HEALTH….. YOU ARE A WONDERFUL SOUL..  PRAYING FOR UR SPEEDY RECOVERY LIZ..",
    "Praying for your fast recovery Miss Liz. I’ve been watching most of your videos/tutorials and answered some of your reading tasks. I’ve learned a lot and We are hoping for your inspiring and motivating videos again. I’m still practicing my grammar and constructing my sentences correctly. See you soon Miss Liz. God Bless You more.",
    "Thanks for your lovely message",
    "You are a great teacher, and all time my favorite.\nGet well soon liz.",
    "Thanks for your support 🙂",
    "Hi Liz, although this is coming in August,2023, I wish you a rapid recovery.",
    "You’re a more than a blessing to millions worldwide.",
    "Thank you. That’s really kind.",
    "Liz, I have discovered you recently. I was initially petrified of this exam, but while reviewing your videos and practising, I feel slightly better about it. I just hope that you are aware of the enormous impact you’ve had on millions worldwide. You’re an amazing soul, hopefully, you’ll recover soon. Thank you, Liz.",
    "I’m so glad the clouds are clearing. Don’t forget to also use the IELTS Cambridge test books which contain real test published by IELTS. Good luck!",
    "Get well soon, Liz. And please take all the time in the world to heal, you have been everything and more to your viewers. God bless you!",
    "In the Thames text: Subaqueous just means under water, but not specifically a river. I find this answer difficult as it’s actually not given in the text.  Specifically these types of answers I find difficult, since there are somewhat logic but in my opinion definitely not given, as a tunnel under a lake is also subaqueous.",
    "Don’t try to match words. IELTS is about a deeper understanding. This entire passage is about a river, not a lake. Pay attention to the whole context and don’t try to separate a sentence or word from the context of the passage or paragraph. Look at the whole meaning.",
    "Hi Liz, I was referred by a friend to your YouTube Channel who just took her IELTS test. I have only spent about 3 hours studying your practice, and it feels like a month. Thanks for putting together this powerful website and explicitly teaching it via YouTube. I will return to thank you in the coming days after my exam success. God bless you.",
    "I’m glad you found my site and are benefiting from it. I wish you luck in your test!",
    "Hello Lizzy! Thanks for your lessons, God bless you for this.\nI have a question regarding Exercise 1(Thames Tunnel). Why is the answer for question 2 FALSE, and not NOT GIVEN? Because I watched your tips video, and you stated that FALSE, is when statement in the question is opposite to what is in the passage. the statement “many people believed it was the eighth wonder of the world” doesn’t look opposite to the statement found in the question (“Thames Tunnel was the eighth wonder of the world”). So why is the answer FALSE? am a bit confused, please help me clear this confusion in my head. Thank you in advance!",
    "The statement “The Thames Tunnel was the eight wonder of the world” is written as a fact. You need to decide if the information in the passage supports this statement being a fact or not. Opinion and facts are not the same thing at all.\n“The world is flat”  is a fact. “Some people think the world is flat” is an opinion. Do you think these are the same?",
    "Thanks Liz, for all you do.\nI practiced for 2 weeks and got a band score 8.\nL – 8.5 R – 8 S – 7.5 W-7\nWe in Nigeria love you.",
    "Great to see your results. Well done 🙂 Love to all in Nigeria 🙂",
    "Hi Lizy,\nThanks for all you have been doing for us in this space, I just booked my ielts text for 21st October I believe with all your lesson I will come out good at the end of the day! I wish my self good success!",
    "Good luck!",
    "Hi, Liz. I am a new learner of your website. While giving a test from Cambridge 9 Test 1 in two particular questions where the answers I wrote are “THE PLANTS” and another one is “THE GILLS”. But in Solution given by the book wrote only “PLANTS ” and “GILLS”. Though  in text these two words are written with articles in front of it. My question is which one is correct??",
    "You didn’t mention which type of question you were answering. That is the key to knowing if you need an article or not. Pay attention to the question type. Some question types might accept articles and others won’t. You’ll get used to it if you pay attention.",
    "Hello , Liz. Thanks for reply. Actually the question type was short question answering. There were questions regarding the paragraph and We have to write answers in no more than three words. And Which type of questions requires articles ? It will be a great help if you provide some insights",
    "Short answer questions only require simple answers. We use articles when we are writing in sentences because they are necessary for grammar, but this is not the case note form. So, question types that are based on notes rarely require articles.",
    "Hi Ma’am Liz, I have difficulty with my reading skills, although, I am now a professional. This  tips have helped me improved a bit with my score. Definitely vocabulary is the key. But your tips help, but still having some confusions. I have to master your tips then.\nI love the way you teach calm and clear.",
    "Good luck!",
    "Hi Liz.\nI am humbly thanks for your free ielts resources. I achieved my required band for my masters ,and all credit goes to you madam Liz.",
    "Great to hear your news! Well done 🙂",
    "Hi Liz!\nActuallly I got a T/F/NG question in actual GT ielts exam, and it confused me. It was –\nPassage – In greyhound buses there is automatic temperature control system. You don’t have to worry about cooling.\nQues: you need to open the windows of greyhound buses in summers.\nI don’t know its answer, but I have marked False. But I am confused that will it be False or Not given. As I’m thinking that someone might open windows for some other purpose as well.\nCould you make it clear to me please?",
    "The statement does say “you can open the windows”. It statement says “you need to open the windows”. You need to decide if it is necessary to open to the windows or not.",
    "It means the answer is false? Bcz of automatic temperature control system, we need not to open the windows during summers, as bus itself will be cool. Nd if they had written- we can open the windows, then it would be Not given, I guess. M I right? 🤔",
    "Do not try to learn TFNG questions by changing the words in the question and deciding it’s a different answer. It does not follow that “we can open the windows” is NG because I haven’t seen the rest of the paragraph. You should always locate the answer and then read around it – sentences before and after. This is NOT about matching words, it’s about deep understanding and analysis of the passage.",
    "Ok ok thanks",
    "Get well soon Ma. I wish you the best in life..infact, I don’t know what to say. Please be fine, we love you.",
    "Thanks",
    "Hi Liz,\nPlease get well soon. All of my best wishes to you. I know God will keep you safe. You are a treasure to many of us. A speed recovery dear.",
    "Thank you",
    "Liz I heard you are struggling with illnesses. I get so upset when I heard this. I hope you will get well in the near future. Is there anything I can do for you? Thanks again for all your help. Best wishes",
    "Thank you. Keep your finger crossed that the next couple of years are calm and stable for me to enable a good recovery 🙂",
    "Hi, Liz ,Good day.\nGod bless you for making out time to see that we get to know these things for free.",
    "Ma’am, you gave a n assignment in one of your  Reading video saying”By the second half of the 17th century, coffee had found its way to Europe",
    "Question: Coffee arrived in Europe after the 17th century..",
    "Ma, I think my answer is “true”, being that, “second half”and “after”seems the same. Pls I would love to hear from you.",
    "I see you watched my video lesson about TFNG reading questions.\nThe problem is that you are trying to match words instead of looking at meaning. I think this is the biggest problem that people have with many IELTS reading questions.\nWhat does “second half of the 17th century” mean? The second half is still inside the 17th century. For example:\n1600 = start of the 17th century\n1630 = within the first half of the 17th century\n1680 = within the second half of the 17th century.\nNow you must decide what “after the 17th century” means. Then you can find your answer. Which century comes after the 17th century and what would those dates look like?",
    "Your teaching style is really amazing. I have never seen any videos like these on YouTube. I will be more beneficial if you make more (IELTS Reading) videos.",
    "I plan to make more once my health improves. Hopefully later this year or next year.",
    "I pray you will be alright soon ma’am",
    "I pray you will be healed. Keep smiling from your heart.",
    "Thanks",
    "I pray for speedy recovery .",
    "Thanks. But my illness is long term and takes year to improve with no guarantee – hopefully the next couple of years will see improvement.",
    "I pray you get well soonest. I’ve learned a lot from your teaching. You’re a great teacher I must confess. Thanks very much",
    "Thanks",
    "We hope that you get better. I am enjoying your videos as well!",
    "Thanks",
    "Hi Liz, its so sad to hear you aren’t feeling at your best. I wish you soonest recovery as you are a blessing to us on these IELTS streets.\nI’ll keep you in my prayers.",
    "Thanks",
    "get well Soon",
    "I pray you will be healed soon, ma’am. You are a great teacher.",
    "Thanks",
    "Take care Liz\nYou are a phenomenal teacher",
    "Thanks",
    "hello Liz, in Beethoven’s paragraph. In Question Number 5 it says that in paragraph symphony was his original work which contradicts the statement given in question as it says it was inspired by famous man..",
    "Do you think that “original work” and “inspired by” are related? These terms are not related at all. They imply completely different things – not opposing things. Take a look more carefully in the dictionary and research their meaning more thoroughly.",
    "Get well soon. You are really doing a great job. I love the way you explain and give us tips. Thanks.",
    "Thanks",
    "I wish you rapid recovery ma",
    "Thanks",
    "So sorry about your health Liz. I wish you a quick recovery. Your lessons are just what I needed. I hope to practice till I become perfect.\nI was finding matching headings difficult until I came across your lessons and got all the practice tests right. But I’m finding it difficult to differentiate F and NG especially in tricky questions. I’ll practice more and improve. Thank you very much.",
    "Good luck!",
    "Thank you a lot Liz",
    "pls tell lessons send by you on any mail is totally free or paid pls reply",
    "When I create new lessons or tips for this website, you will get it by email if you have subscribed. Otherwise, you can use visit my website and find the new lessons listed in the side column. This website is free. There are over 300 pages of free lessons, tips etc already. I also offer discount offers on my Advanced Lessons & E-books which can be found in my store. Those are paid lessons and are separate to this website.",
    "I want your advance lesson, I booked ielts exams for 24th of may  and I live in Nigeria. Is it possible?",
    "Sure, click here: https://elizabethferguson.podia.com/",
    "Thank you, Liz. Your lessons help me a lot.",
    "Hi Liz,\nI’m so thankful for the free IELs resource. It has been so helpful for all those looking for a reliable avenue to prac. I have my exam in a month’s time (attending GT exam in the US). I will share my exp irrespective of what band I achieve so that others will have an idea about it.",
    "However I am slightly worried as I could see the model question papers from IELTS USA website is pretty harder than BC/IDP. A couple of my friends who attended IELTS GT (in India) shared the same (USA is harder than BC). I have booked my test through IELTS USA website. Could you please share your thoughts on this. Has any other student has told you about a similar situation to mine.",
    "For instance,\nIELTS cambridge book questions are relatively simpler than Barron’s questions.",
    "I look forward to your reply.",
    "You need to understand who writes the IELTS tests. The tests are NOT written by BC or IDP. The tests – all the IELTS tests used in the world for testing in all countries in all test centres – are written by Cambridge IELTS. This means BC and IDP use the tests which are written by Cambridge IELTS. This means that all the tests are equal in level throughout the world. IELTS is owned by BC, IDP and Cambridge – three owners. IDP and BC conduct the tests and Cambridge write the tests. This means any person who tells you that BC is harder than IDP or that X or easier than Y are giving you their personal opinion which is not based in fact.",
    "Old test papers are published in the IELTS Cambridge tests books, you can see a description of them on this page: https://ieltsliz.com/recommended-books-for-ielts/. All other tests which you buy in books, such as Barron’s, are not authentic IELTS tests. Those tests have been written by authors who do not work for IELTS. They are useful tests for practice, but are not authentic and are not past test papers. You can use any materials you want for preparation. For example, my lessons have been written by myself for your development and I recommend you use them. But always make sure that you use authentic test papers published by IELTS as part of your preparation because they are real test papers.",
    "The more you understand about the test, the better you can prepare yourself. There are over 500 pages of information, lessons and tips on this website for free – start using them and learning. Good luck!",
    "Hi Liz,",
    "Thank you for your efforts to make us understand the T/F/NG,\nI have a confusion about two of the questions from Cambridge Book 14\npassage :\nTransition care is for older people who have been receiving medical treatment but need more help to recover, and time to make a decision about the best place for them to live in the longer term. You can only access transition care directly from the hospital.\nQ : Only hospital patients can go on to have transition care.\nAnswer : True\nI feel that the question is having incomplete details. It is mentioned in the passage that transition care is for “older people who are from hospital”. But the statement just mentions about “hospital people” and doesn’t it mean all people from hospital are eligible for transition care right(? Is it not a contradictory statement? Why not the answer is “FALSE”?\nCan you please help me understand this ?",
    "Also, there is another question :\nPassage: Transition care is often provided by non-government organizations and is subsidized by the government. If your circumstances allow, it is expected you’ll contribute to the cost of your care.\nStatement :\nEveryone receiving transition care must contribute to the cost\nAnswer :False\nMy argument is that it is only subsided by government and everyone has to pay for the services, don’t they?\nCan you please give explanation for this as well?",
    "The problem here is that you are trying to match words and you haven’t decided if you are matching the passage to the question or the question to the passage. You are jumping between them both, trying to match them. This doesn’t work. Step one – look at the question statement. This is the key statement. Take your time to understand it. We need to find if only hospital patients can get transition care. We are not trying to match information, we are trying to see if we can prove this statement.\nTrue – only hospital patients can receive transition care\nFalse – any patient can receive transition care – this would mean patients outside hospital as well as inside or patients outside only\nNG – we don’t know if hospital patients can receive transition care\nNow, it is time to look at the passage and see if this information is proved, disproved or we can’t say.\nThe passage states: “You can only access transition care from hospital”\nThis proves the statement.\nDo you see how you jumped from one to the other trying to match them? Instead, focus on the question statement and spend time preparing your True, False and NG before you tackle the passage. This is about proving the statement or disproving it or whether there isn’t enough information given.",
    "With the second example, you jumped too quickly from passage back to statement. We need to know if everyone must contribute to the cost. Once you find the area in the passage that contains the information, read carefully. Don’t jump back and forth. Spend time making sure you have understood all the words given. Also look at information before and after in the passage to see if there is anything else relevant. The passage shows our question statement is wrong. The question statement is incorrect. The passage shows that “if your circumstances allow…” – this means only if you have the money. In other words, if you don’t have the money, you don’t have to pay. Paraphrasing is a useful skill in this case – it isn’t about synonyms, it’s about finding another way to express the same information. Analyse for deeper understanding. Remember this isn’t about matching words.",
    "I hope this helps 🙂",
    "Thanks a lot, Liz. This is really helpful. You just pointed out my real problem of matching passage to the statement whereas it has to be otherwise.\nAlso , I just wanted to say that my T/F/NG scores improved after reading your tips.\nYou are of great help. Thank you",
    "Brilliant!!",
    "Hi Liz,\nHope you are in good health. I recently gave my IELTS. Your tips and advanced lessons are treasures for people like us who don’t have time to get themselves enrolled in a coaching class. The way you explain things is so detailed and simple at the same time. I also appreciate the effort you put in to highlight the things that people do or prepare for unnecessarily. Your model essays, on the exam day tips, fill in the blank exercises, videos on youtube are just one of their kinds. I feel really fortunate to have found your blog or else I would’ve kept wandering to find the right resources to prepare from. The grace and smile with which you explain things is just remarkable.\nThanks a lot Liz for every effort that you take to teach us. You’re the best!!!",
    "Thank you so much for your kind comment. I’m so pleased me lessons are useful to you. Wishing you lots of luck in your test!! 🙂",
    "Hi Liz,\nfirst of all thankyou for existing. Because of u I learnt soo many things in IELTS.\nand here,some other ques\nThe passage says: For example, when using the one, two, many type of system, the word many would mean, Look at my hands and see how many fingers I am showing you.\nThe question says: Some peoples with simple number systems use body language to prevent misunderstanding of expressions of number.\nso the answer here should be ‘NOT GIVEN’ right? Because they have not mentioned about PEOPLE in passage.\nbut the answer is ‘TRUE’. how is it?\nI got this doubt because u said in a video that if it was given ‘MORE PEOPLE’ in passage, then the answer would have been ‘FALSE’.so that means we actually have to consider the words ‘SOME PEOPLE’.\ncan u explain please.",
    "The problem with this is that you looked at the wrong part of the passage. The answer was contained here:\n“But in real situations the number and words are often accompanied by gestures to help resolve any confusion”",
    "Hello Liz..!!\nI have just received my results for IELTS and have scored an overall 8 band (LRWS- 8.5, 9, 6.5, 7.5).\nThank you so much for your efforts. The material on your website is amazing. I referred your material from the starting, which helped me score my desired band.\nThank you again..!!!!!!😊",
    "Great to see your results. Brilliant Reading score 🙂",
    "wow congrants\nhow 9 in reading?mind to share tips?",
    "Thanks..!!\nFirstly, you are already at the right place. Refer to Liz’s website and Youtube videos, and not just for reading, for all the sections.\nSecondly, you might feel that you are not able to find answers, but I realised while practicing that answers are always in the passage, just search at the right place. Paraphrasing technique comes handy here.\nNext, in True/False or Yes/No Not Given questions, just read the instructions that defines True, False and Not Given (Yes, No and Not Given) again and again after reading the question statement.\nDo Not skim the passage when reading first time, read properly. Now that dosen’t mean that you understand each and every line, but JUST READ ONCE.\nAnd lastly, practice as much as possible, but not on the expense of other sections.😉",
    "Hi Prasanna,",
    "It’s really amazing to see scoring 8.5 in listening and a perfect 9 in reading.",
    "How did you manage such an excellent score? I am tired of TFNG questions where I always made mistakes in 2-3 questions. Can you share the strategy you used?",
    "However, I am closely following the tips and tricks from Liz and it helps me a lot.",
    "Thanks,\nBrijesh Singh.",
    "Hi Liz,",
    "Thankq so much first of all for your great work!\nAlso I want to understand the below T/F/NG exercise Qn. from the cambridge practice book.",
    "Passage:",
    "The possibility of returning to Dover to search for the boat’s unexcavated northern end was explored, but practical and financial difficulties were insurmountable- and there was no guarantee that the timbers had survived the previous decade in the changed environment.",
    "QN:\nArchaeologists went back to the site to try and find the missing northern end of the boat.",
    "Answer: False",
    "Is it not true according to passage? Passage says “explored”. As per the passage bringing back the Dover bot only seemed to be insurmountable due to the timbers survival but the search was said to be explored.",
    "Kindly clarify here.",
    "Thanks in advance!",
    "This is a great example of how grammar can help you understand the answer. The word “explore” does not refer to exploring the northern end of the boat. The word “explore” refers to the “possibility of returning”. In this context, the idea of returning was explored – the idea was discussed – the idea was analysed – but “the difficulties were insurmountable” (too much). Now you know that the idea was dismissed and didn’t happen. Hope this helps 🙂",
    "thank you Liz. I learnt from this too",
    "Exactly , They have explored the  “idea” not the boats missing part, The best thing to do is, find the keyword, the you find the sentence, after that read that sentence twice or thrice to understand, then compare with the question. (Now don’t tell, we don’t have much time to do all of that, if you practice this more often, it’s a piece of cake.",
    "Thanks Liz,",
    "Hi Liz,",
    "Thank you for making IELTS easy for learners like us.",
    "If you don’t consider what I am about to ask odd, I would like to know; in the passage Beethoven, if the question following the paragraph “Beethoven was widely considered the greatest composer of all time” was put this way..” Was Beethoven the greatest composer of all times?” would the correct answer have been NOT GIVEN or TRUE.",
    "Do reply please, and kindly give reasons for your answer. Thanks",
    "TFNG statement questions are written as statements and never as direct questions. The only direct questions in IELTS are short answer questions and they do not require answers such as the word “true” or “false”. They require words taken from the passage. Try not to confuse the question types. If you go to the main Reading Section of this website, you’ll find a list of question types which can appear in IELTS Reading.",
    "Cambridge /GT12/Test 7\nTest 7:\n//Courses are run regularly for groups of up to four trainees. We use professional\nmechanics’ tools and employ experienced staff. Most importantly, we have tea- and\ncoffee-making facilities and a fridge where participants can keep their sandwiches, etc.\nUnfortunately our training room is up a flight of stairs.//",
    "Question 11)\nSnacks are provided for participants on the maintenance training courses (T, F , NG)",
    "I thought the answer was NG but why is it False? Please help.\nThanks.\nLiza",
    "The information is given here: “a fridge where participants can keep their sandwiches, etc”. This means people can bring their own snacks from home and store them in the fridge. This information shows that snacks are brought in by participants – not provided on the course. Do not try to match words. Look for the general meaning.",
    "Hi Mam, Thank you for your time.\nIn exercise 3, question 5:\nBeethoven debuted his Symphony No.3 in Napoleon’s honor. It was his grandest and MOST ORIGINAL  work to date – so unlike anything heard before……..",
    "I think the answer to the question 5 is FALSE because the information contradicts to the passage ( it was his grandest and most ORIGINAL work to date) he wasn’t inspired by anyone.\nThank you madam.",
    "Everyone is inspired by someone or something when they create an original work. Make sure you check the correct meaning of “inspired”. Something being original doesn’t mean there was no inspiration behind it.",
    "Hellow Liz,",
    "Regarding passage 1,question 4\nYour answer was NG, but in the passage it was mentioned that the tunel was used by all people classes",
    "Can you explain this issue please",
    "But we don’t know which groups of people used it more and which groups used it less. This information is not given.",
    "Hello Liz,\nYour lessons and videos are helping me alot, I m preparing for General ielts.\nCan you please help me with the following true and false in reading section 3 of Cambridge ielts book 8",
    "Paragraph:\nSnake oil was a dismissive term for the patent medicine, often useless, sold by traveling traders who always claimed miraculous cures for everything from baldness to snake bite.",
    "Question:\nSnake oil sellers believed their product was effective.",
    "Answer in the book is false.\nBut what I understood from the paragraph is that traders are sellers who always said their snake oil has cure for everything means it’s effective, am I getting right idea?\nBut why it is false\nCan you please help me.",
    "You were looking for the answer in the wrong paragraph. Look at the next paragraph and you’ll find the answer in the first sentence. Whenever you think you find the answer, always read around that area – don’t just read one line. Read a few sentences before and after so that you check there isn’t other information which might affect the answer.",
    "Hi Liz, How are you? liz I want to take the print of reading passages can you send me all passages so I can take print out and start practices..",
    "Thank you!!!",
    "Sorry, I don’t have that option at the moment. However, I’m currently working on making Advanced IELTS Reading Lessons for my online store and all reading passages will be downloaded. These lessons will teach each question type in detail.",
    "Liz is the advanced Ielts reading lessons ready?",
    "I’m so sorry. I’ve been sick again recently. My health just won’t stabilise enough for me to do much work. As soon as I’m well enough, I’ll finish the Advanced Writing Task 2 lessons to create a full Crash Course for WT2 and then I’ll do the Reading Lessons. Keep your fingers crossed I start getting better over the coming months.",
    "Hi Liz,",
    "Thanks for value information with True and False session,",
    "Can we expect this type of questions for real IELTS exam.",
    "Please clarify it i am having my exam in less than 2 weeks",
    "The TFNG question type is one of the most common. See this page for tips and information about the reading test and question types: https://ieltsliz.com/ielts-reading-lessons-information-and-tips/",
    "Could “Not Given” be fit at the Beethoven passage – statement 3 as well?",
    "He was deprived of sleep, but the reason for this fact was not presented. Was it caused by his poor performance during the father’s lessons? Or it happened because his father was odd and had an aggressive pattern? or who knows, Beethoven was a bad kid and had it as punishment",
    "My point is: The answer for this statement is not in the passage, therefore there are subjective interpretations.",
    "I think a lot of people have a problem with this one. The reason for being deprived of sleep is explained in the passage. You do not need to interpret, it is clearly stated.",
    "“…deprived of sleep for extra hours of practice”",
    "This means he was not allowed to sleep because he had to use the time to practice more. Now we can see that the statement “Beethoven was denied hours of sleep as a punishment for poor performance.” is actually incorrect. We know he was deprived of sleep for a different reason. So, the answer is FALSE.",
    "In the last question for the first paragraph (Thames Tunnel), the answer that you’ve provided is True but the paragraph only says that the tunnel is now in use as part of the underground railway system. In this case, shouldn’t the answer be ‘Not given’ because it doesn’t say if the tunnel is now used by pedestrians?",
    "The precise words are not needed. You are looking for meaning. If it is a railway, it is not used by pedestrians.",
    "Liz I would really appreciate your efforts…you teach brilliantly !!!\nEven I have the same question as kishan had ,about (passage 1:Thames tunnel) 8Q …\nCan you please let me help in  explaining  more accurately and lucidly ..\nSince it’s mentioned” as a  part of the underground system “…Didn’t mention particularly about the tunnel being used only railway",
    "Railways are used by trains (whether underground of not), not by people walking on them. Rem,ember, you are not looking to match words, but to discover meaning. The passage shows that the function of the tunnel has changed completely from people walking on a walkway to trains running on tracks in an underground train system.",
    "Maybe, I am overthinking, but railway networks these days also have pedestrian subway and foot-over-bridges as a part of their network. I marked the answer as FALSE since “no longer” is the opposite of “in use”. Even though, the purpose of the tunnel was in debate for me. What are your thoughts?",
    "It sounds like you are overthinking. If the railway doesn’t mention a footpath, then it isn’t there. IELTS is about what information is given, not what you might hope for. The word “railway” doesn’t include “footpath” in its meaning. This is what you focus on. What information is given and what precisely does it mean in English.",
    "Hello,",
    "This is regarding your reply for Passage 1, Question 8:",
    "As per my understanding, we are supposed to understand the meaning but not allowed to predict any additional information. I am aware of railway bridges in the world which have a pedestrian sidewalks in parallel. How can we make a prediction in that case. Kindly explain.",
    "If it had a pedestrian sidewalk that needs to be considered for the question, the passage would have mentioned it. You task is to answer questions based on the information in the passage – no other information, predictions, presumptions or knowledge are relevant.",
    "Hi Liz – Thank you for your tips and study material, this has been very useful!",
    "In Passage 1 Q4 – Should the answer not be ‘False’? Towards the end of the passage, there is a sentence that says that eventually, the tunnel was used for nothing more than tourist activities, and the text in the first half of the passage stipulates that it was the upper and middle classes that used it for tourism. When you look at these two pieces of info together, does it then not imply that eventually a majority of the use was for tourism and by the upper and middle classes?",
    "Will appreciate your thoughts on this please!",
    "Thank you in advance!",
    "In",
    "1. Try not to jump around in the passage to gather information. TFNG questions have answers that appear in order. This means you can’t find information for the answer of question 4 after the answer of question 5 in the passage.\n2. The statement says “the tunnel was used more by upper and middle classes”. This means the number of people using it. There is no information in the passage which compares the number of people using it.\nI hope this helps.",
    "Very useful. Thanks again for your help and time.",
    "Hi Liz,",
    "I hope you are feeling better now.. your website and all your vedio’s are so helpful so first of all I would like to Thank you from the bottom of my heart 🙂\nI wanted to ask one question Liz, does it matter how we Write the answers in reading and listening as well? for example the answer to one question is “Universe” so does it matter how we write??? i.e. “universe”, “Universe”, or “UNIVERSE”?? in both reading and listening??\nwhich out of three option will be correct ?",
    "Many thanks,\nDevika",
    "It is always best to write USING ALL CAPITAL LETTERS for both reading and listening answers.",
    "Hello Liz",
    "Thank you for the wonderful assistance you are doing in ensuring that people pass their ielts exams . Please i am a bit confuse on the question  of Thaames Tunnel No2",
    "part of your Tips in TFNG states that when you see a comparison in the question or answer it must be in the other one two else it will be NG",
    "The question goes :  Thames Tunnel was the eight wonders of the world",
    "The passage goes : many people believed it was the eight wonders of the world",
    "I thought because of the comparison MANY not found in the two statements it will be NG . Please expalan",
    "I wish you the best of health",
    "The word “many” in this instance is irrelevant. This is about whether it was, factually, the eight wonder. The passage shows that it wasn’t. The passage shows only that many people believed it was which isn’t the same as a fact.",
    "Hi Liz, may I ask why the answer of question 3 in exercise 3 is F instead of NG? Which are the clues indicating that Beethoven was not forced to deny hours of sleep to practise?",
    "I am confused by your question. The actual question is “Beethoven was denied sleep as a punishment.” Your task is to find out of the passage supports this information, contradicts this information or doesn’t explain it at all.",
    "first of all thank you for support, I wish good health. I still do not understand ,the passage did not state the reason he was deprived of sleep. please, explain further why the answer is NG.",
    "If you check the passage again, it tells you the reason: “for extra hours of practice”.",
    "Hi Liz,\nThank you for the lectures. Am confused please clear me. In the first passage, question 4 says the tunnel was particularly popular with middle and upper classes.\nI chose false using this sentence in the paragraph “the Thames tunnel was used by people from all classes ” but your answer is not given.\nIs it the popular that makes the difference?\nThank you.",
    "Yes, it’s the word “popular” that is the issue. “popular” is about what is liked. Was the tunnel more popular with middle or upper classes? Do we have information in the passage which shows which group of people liked the tunnel more or used it more? Is there a comparison given?",
    "Hey Liz !! Hope you are in the pink of your health. I am writing to you as I had a query regarding the 4th question of the “Spam messages” paragraph. Wouldn’t “more than 300b” means “increase” in spam messages? So shouldn’t the statement be false?",
    "more than = over. Those words do not reflect change. They do not relate to increasing and decreasing. There is no information given about any numbers increasing.",
    "Hi liz,",
    "I have given my ielts exam and i have written T,F&NG instead of true false not goven in my reading exam. Do they deduct the marks for that? Because in the question they mentioned that write true , false, not given. Please comment whether the checker consider it an incorrect answer",
    "It’s fine to write the letter only.",
    "Hey..\nTFNG reading :Exercise number 3",
    "5. beethoven”s symphony no 3 was inspired by a famous man\nin the passage it clearly says , Symphony no 3 in napolean’s honor . it was his grandest and ORIGINAL work, and so it should be false isn’t it?? pl enlighten me 🙂",
    "Actually it does not say “Symphony no 3 was in Napoleon’s honor”. It said “Beethoven debuted his Symphony No. 3 in Napoleon’s honor.” and this is something quite different. To “debut something in someone’s honor” has no relation to the inspiration to initially create something. You can’t ignore two words and presume it all has the same meaning. Those two words completely change the whole sentence. Always check each word in the statement given. Always check if the information in the statement is given in the passage ie does the passage show who inspired this work to be created?",
    "Well Elucidated!",
    "Hi liz,",
    "I have given my ielts exam and i have weittwn T,F&NG instead of true false not goven in my reading exam. Do they deduct the marks for that? Because in the question they mentioned that write true , false, not given. Please comment whether the checker consider it an incorrect answer",
    "Hi Liz, really appreciate your efforts for providing such amazing materials. For exercise 1,  I think Q 4  is False as the passage said (for all people classes , however, the question said particularly for middle and luxury class which contradict with the word all , also for question 8   said (no longer  used ) which is also is the opposite of being used until today , so i think it is false",
    "oooh , for Q 8 I got it , but still confused about Q 4 , thanks",
    "You are focusing only on specific words in the sentence instead of the full meaning. Do not focus on one word only. Question 4 is about popularity and the passage is only about usage. Question 8 is the way the tunnel is used – is it the same use today as before?",
    "Thank you so much mam. Your Lessons are really helpful.",
    "You’re welcome 🙂",
    "Thank you ma, this is helpful. Kudos!!",
    "The way you talk is just incredible. This blog of yours is everybody’s favorite because you are doing this great work selflessly. Kudos to you mam",
    "I’m really glad you enjoy the lessons 🙂",
    "hi Liz ..Thank you very much for your guidance.\nFor the below Passage, I had the following  TFNG question. And I felt answer should be ‘False’ as work hours are flexible  Please correct me if I am wrong.",
    "Question\nAll employees must work between 9.30 am and 4 pm, except for lunch time.",
    "Passage\nThere are no prescribed hours of attendance for office managers. The main office hours comprise a 37½ hour week worked from 8.30 am to 5.00 pm on Monday to Friday, with one hour for lunch. All sections work a flexitime scheme of attendance which features core hours from 9.30 am to 4.00 pm with a lunch break of between 30 minutes and two hours’ duration, with the opportunity to work from 7.30 am to 6.00 pm daily, at which time the premises are locked. Office managers do not qualify for overtime rates for any additional hours worked, but time off may be taken for any hours required to be worked at weekends.",
    "They have a flexible scheme but the CORE hours are: 9.30-4pm except for lunch.\n“All sections work a flexitime scheme of attendance which features core hours from 9.30 am to 4.00 pm with a lunch break of between 30 minutes and two hours’ duration”",
    "Hi Liz\nhelp me with this one doubt 🙂",
    "in the second passage its not clear whether the road is lubricated by Egyptians or water was already naturally present then how could this be true?",
    "The words are: “in front of the sledge was wet with water…” This means someone wet the sand. The word “wet” is a verb used in the passive voice with the person doing the action not given because it is not necessary to state which person – someone did it.",
    "Please can you assist explaining why the first exercise No 8 is True, i chose Not Given",
    "The London Underground system is a railway system, not a walkway.",
    "In reading passage 3, ques 3, “Beethoven was denied hours of sleep as punishment for poor performance.” The answer is FALSE. But according to instructions False is attributed to opposite meaning in the passage, which should be “High performance” , but it is given “for practice”. BY this logic answer should have been NOT GIVEN.\nPlease clarify.",
    "False means two things: – opposite meaning / incorrect information. This information is incorrect and the passage shows the correct version.",
    "Oh, thank you very much! I needed the same clarification on this. I thought False is only for a contradictory statement.",
    "It’s great to see how you give guidance on even minute details. Extreme respect for you.",
    "Wish you get everything\nStay healthy\nThanks",
    "Passage 3 question 6",
    "The second last paragraph starts with mentioning of 1804 so the “Turn of the century ” here means that 20 th century but in the question there is early 1800’s which is not same.\nThen how is it true? Should be false? Please help Liz.",
    "“Turn of the century” is an expression which depends on the content. It does not refer to only one century, but rather the century being referred to in the passage. If Beethoven was born around 1770 which century do you think they are referring to?",
    "Mam I did your all TFNG but I find prob in exercise 4 question 6..( in last passage it is written that “American,by comparison,…)in this sentence they compared American with whom??  And why they write in comparison???\nPlease mam explain. I try to find in comments but I didn’t get answer. Please explain it will help me and my actually my reading is weak so I need your explanation mam",
    "The whole paragraph up to the point of mentioning Americans is about the Chinese. This means there are two nationalities which are being compared to each other.",
    "Thank you soo much mam. You are really helpful.\nAnd your all lessons are really helpful to me.",
    "Try not to take sentences out of the paragraph. You need to understand them in context. Read the sentences before and after to understand. This applies to many answers you will find in IELTS reading.",
    "Aunty Liz, you will make heaven.",
    "Thank you for all you do.",
    "Hi Liz,\nThank you so much for all that you’re doing for me, I am anticipating a high score.\nPlease is it okay for me to use the general training past questions to read for the academic exam which I am going to write?. Most of the Ielts Cambridge practice tests books I see are for the general training and so I wondered if it will be worth anything to study them since I am going to write the academic exam.",
    "All the IELTS Cambridge books which are numbered are for the Academic test as well. This means each number in the series has been released for the GT test and also for the Academic test. That means there are 14 books at present each with 4 Academic tests in. Definitely, prepare for the Academic test using Academic practice tests. The GT reading tests are easier and won’t be so helpful for you.",
    "Hello Liz,\nI am urging to you for a help. I have practised your TFNG Reading Passage-2: “Pyramid Building”.  I struggled with two questions ( no. 5 and 7). Could you explain me those questions for me.\nI am waiting for your kindly help.",
    "I have added more explanation in the answer key. Check again and hopefully it will help.",
    "Hi liz,\nWhy you are not making some new videos??? Your videos show time of upload that is 5 years ago, with the passage of time ielts format and procedures are still same???  Please reply",
    "Read this page and you will learn why: https://ieltsliz.com/determination-my-story/ . Yes, the format and procedures of the test have not changed, except for the listening example being removed from the start of the audio and IELTS being available on online or by computer – all of which is explained on this website.",
    "Hello, Liz. Thank you for helping me a lot with informative website. I have a question about Yes /No/ Not Given and True / False/ Not Given question. These questions are often given in order. Should I skim these question or scan to answer?I tried to skim , but sometimes there are no keywords, so I got confused to find it.                Thank you for your time and kindness.",
    "I think you are confused between skimming and scanning. Skim means to read quickly for gist and not for deeper understanding. IELTS recommend you skim the passage before you tackle the questions. You NEVER skim the questions. You don’t read questions for only a brief understanding. You analyse the questions deeply. You spend time thinking about paraphrases and keywords before you return to the passage for the answer. There will always be keywords – often they are paraphrased. Scanning means to look quickly through a passage for specific information – this is how you locate the answer. You use the keywords or paraphrases of the keywords to locate the answer.",
    "Dear Liz,\nYou site is very informative. you effort and way of coach is also tremendous. I have one question and hope you will reply me:",
    "Statement:\nEvery year we are delighted to see more riders wearing protective helmets, but\nwe would like to see every cyclist on the ride wearing one. More than half of\nreported injuries in cycling accidents are to the head, and a helmet gives the\nbest protection when the head hits the ground.",
    "Q:Helmets are compulsory for all participants.",
    "My answer was NG but online its answer was mentioned F. As see, there is not conflict in statement against question. Would you please guide?",
    "Thanks and Best regards,\nHabib",
    "The key is here: “…we would like to see every cyclist on the ride wearing one”. This conflicts with the information in the question statement.",
    "Hi Liz.",
    "Firstly i am very happy to stumble upon your blog where you have given your heart and soul for aspirants like me to get trained and score higher bands in IELTS.  Secondly, more positive and power for you to overcome the lockdown the entire world is facing. I would like to have more training materials for Reading ,Writing and Listening sessions . Looking forward to take more of these tasks and will keep you posted with my feedback. Thanks",
    "Go to the HOME page and you’ll find access to all free lessons for each section of the test 🙂",
    "Hi Liz,",
    "You are an awesome person. Shall pray for your quick recovery. Please take care of yourself. Your sessions are extremely helpful. Thank you for your efforts.",
    "I’m glad the lessons are useful 🙂",
    "Shouldn’t passage 2 question 5 be false instead of true?\nIn the passage it uses the phrase ‘common thought’ which you said means many people believed.\nBut the answer sentence says some believed.",
    "“All” and “none” are opposites and contradict each other. One means 100% and the other means 0%. The words “some” and “many” refer to no specific amounts and therefore are not opposites.",
    "Sorry..\nIt may be an inappropriate question but I cannot understand one question…\nI practiced reading in website witch you recommended or Blitish Council’s reading yesterday . And, I cannot really understand why I should choose C instead of D in section1, number 9.\nA question is ” in order to lose wight, we should…” and I think D is correct.\nSo if you like, please tell me the point…",
    "I do not fully understand your comment. Are you asking for advice on a specific question about a specific reading passage? If you wish for advice, you would need to provide the full question and the complete area of the passage where the area is located. I can’t help you unless you provide sufficient information.",
    "Hey Liz, What you do to help us is much appreciated. I would like to ask about and  am a bit confused with the answer 5 of exercise 3, I believe “in someone’s honour” has similar meaning with the word “dedicate”; if so, can we not say saying that “it is inspired by …” is “False” instead of “Not Given”? Because it is dedicated and not inspired which makes the statement “False” in my opinion. I would really appreciate if you could help me understand that.",
    "You are getting confused between matching the passage and matching the statement. Stick with the question statement only until you have done your analysis.\nQuestion Statement: “Beethoven’s Symphony No. 3 was inspired by a famous man.”\nTrue – it was inspired by a famous man\nFalse – it was not inspired by a famous man (perhaps it was inspired by the sound of water, for example, or someone who isn’t famous)\nNG – we do not know where the inspiration came from.\nNow that you have prepared your understanding of True, False and NG, it is time to check the passage. What does the passage show according to the above???? Does the passage show what or who inspired Beethoven to write the music? Take a simple logical approach.\nYour mistake is one of technique. Learn the from above to avoid this mistake in the future.",
    "But the question is “was inspired by a famous man”. The passage has this line “It was his grandest and most ‘ORIGINAL WORK’ to date”. So I understand that it is not inspired from someone. It is his original music.",
    "You have misunderstood the word “inspire”. Every original work comes from inspiration either from a person, place, animal or thing.",
    "Hi, can you explain me in Exercise 1 The Thames Tunnel why the 2 statement is True in text there are not anything about sea or land???",
    "Are you sure there is no mention of travelling by sea or land? Don’t look to match words. Matching meaning. You will find the answer – it isn’t a long passage.",
    "I am 58 years of age. Love doing the reading test. Love listening to you. The way you explain and specially the movement of your eyebrows and the way you smile when you explain a tricky question.",
    "Didn’t realise I was so expressive 🙂",
    "I agree with you",
    "Nowadays, I’m preparing for IELTS and find your Youtube Videos which really helpful for me during this period.\nLove it, the way you explain each questions is prodigious. Thanks a lot for teaching us effectively.All in all this website is Best.",
    "You are a Great Teacher in the IELTS World.",
    "Many Thanks Dear Liz…Stay Blessed",
    "I’m really glad you like my lessons. Stay safe !!",
    "Dear Liz,",
    "Learning through your videos itself is self-perpetuating experience, do you recommend buying the Cambridge  IELTS book even after going through all of your content.",
    "Please advise.",
    "Sincerely,\nAmjad",
    "Definitely. The IELTS Cambridge books contain real IELTS tests. You need to practise doing real tests at home. Some you can use for general practice. Others you can use to do a complete LR&W test under exam conditions at home. Do at least two before your real test under those conditions with the answers sheets, timing etc.",
    "Dear Liz,",
    "Appreciate your reply. Will follow as guided.",
    "Stay Safe!",
    "You are a great teacher. your words are clear and precise.",
    "Get well soon liz .. And thank you very much",
    "Thanks 🙂",
    "Dear Liz ,\nYou are really great!!! You are the best trainer in my life . Your teaching skills are amzing . You really make our IELTS’s journey too easy . You are the best .\nGode bless you",
    "Thanks",
    "Thanks. It’s great to know that my lessons are helping you 🙂",
    "YOU are more than an amazing lady. Lots of love and an immense feeling of gratitude. God bless you MIRACLE. You get what you give others. I am really really hoping great health is on its way to you because you don’t deserve long term problems.",
    "That’s really kind. Thank you 🙂",
    "Hi Liz,\nhello guys. Can anyone help me? I have problems in following TFNG questions.",
    "question 1 The light on the sidewinder can be difficult to illuminate?",
    "paragraph…. if the potential to create battery power without the use of an outlet as not enough, some models such as sidewinder, even have a built-in LED light that will work after a few seconds of cranking, This feature could be helpful in the event you have lost your phone and there is no other available illumination.",
    "question 2  The quality of a DVD picture is nearly the same as the quality in a cinema?",
    "DVD picture quality is better and many DVDs have Dolby Digital Or DTS sound which is much more closer to the sound you experience in a movie theater.",
    "question 3 It is not necessary to get a teacher’s permission for all experiments?",
    "No changes from the instructions will be allowed without permission from the teacher or instructor. Never perform an activity that is not authorized or supervised by the teacher or instructor. Do not operate equipment without operating instruction or specific permission fro the teacher or instructor.",
    "question 4  The SAC will close at 3 pm on 23 December.\nStudent print will be closing for the semester at 3 pm on December 23 and the SAC will be closed until Sunday, Jan 9.",
    "Question 5. You should not do any weightlifting if u have heart disease?",
    "you might have to modify or avoid weightlifting if u have muscles or joint problems, seizure disorder heart disease, high bp previous injuries or any other physical condition with potential for danger.\nquestion 6 It is a good idea to clean your hands between exercises.",
    "use equipment after wiping them, wash your hands after your workouts. This may reduce your chance of catching any virus.",
    "please help me to solve these questions.\nplease author post these questions so that everyone can get a chance to solve some TFN questions.\nthanks in advance. 🙂",
    "I just tried, and so my answers are\n1 F, 2 NG, 3 F, 4 F, 5 F, 6 NG\nNot sure, whether these are correct..🤷‍♀️",
    "yes, @Ajwinder Kaur all are correct but 4th one is not given. because it does not mention when it will close they said SAC will be closed until Sunday 9th but when closed not mention so it is NG.\nbut can you explain to me 1st,3rd, and 5th ???",
    "4th one is really tough, anyway, as regards 1st question, the sidewinder has built-in LED light which starts in just a few seconds whereas the question says it is difficult to illuminate,\nFor 3rd question, there are 3 lines in the paragraph, which say,  nothing can be done without permission from teacher or instructor, although question says the opposite\nFor 5th question, the paragraph says, for all the mentioned physical disorders, you might either have to avoid or modify…., but the question says only about avoiding not modification…",
    "As against the first question, the paragraph says that the sidewinder has built-in LED light which work in just few seconds, so it’s not difficult to….\nFor 3rd one, the paragraph says permission is at all necessary whereas the question says the opposite\nFor 5th, the question says should not do any weightlifting, but paragraph says, either modify or avoid it….",
    "Got it, thank you dear @Ajwinder Kaur 🙂🙂",
    "Can’t thank you enough Liz! these exercises are really helpful. By the way how is your health? I wish you a speedy recovery.",
    "I’m so pleased the lessons are useful 🙂 I have a long term health problem, but it’s under control at the moment. I hope to see some improvement later this year. Thanks for asking. I hope you are keeping safe and well 🙂",
    "I hope you get well soon Liz. Take care of your health.",
    "Thank you 🙂",
    "I HOPE YOU WILL GET BETTER SOON ,GOD BLESS YOU..",
    "Thanks.",
    "Hi Liz,\nHope you are doing great. I was attempting TFNG for the passage “Spam Messaging”.\nI got 5/6.  For the fourth question: I thought it should be False but actually it is NG. The reason why I thought  this is false because the passage says",
    "“They received more than  300 billion of them in 2013”",
    "and  in  the question statement, it  is written “In 2013 the number of spam texts increased considerably to 300 billion.”",
    "So , are not the phrases “to reach 300 billion” and “more than 300 billion opposite to each other?",
    "Would appreciate your reply on this.",
    "Regards\nZia",
    "“more than 300 billion” means over 300 billion. This means for example 350 billion. Does it tell you whether this was an increase or decrease from the previous years? Pay close attention to the meaning rather than matching words.",
    "Actually, i thought that its true but then i read your comment in the answers and found that there were nothing mentioned about increase and decrease. It does make a lot of sense. Thank you",
    "Great. I’m glad my explanation helped. Hopefully it helps you see how important it is to analyse the meaning of the question statement very carefully before looking in the passage for the answer.",
    "Hello Liz,",
    "In passage 3 the first question shouldn’t it be False?\nSince they say “exactly” and the text says “or near”",
    "The question statement says “it is not known exactly”. You need to decide if the passage gives a precise date or not.",
    "Hi Liz, I have one question in true/false/not given.\n Question: Most light pollution is caused by the direction of artificial lights rather than their\n                  intensity.\nI wrote NOT GIVEN because they didn’t mention any information about intensity.\nAnswer: True\n                                  In their explanation, they mentioned ‘light pollution is largely the result of bad lighting design, which allows artificial light to shine outward and upward into the sky [=direction]….’ ( there is no mention of the intensity of artificial lights begin a problem).",
    "You have not posted the full paragraph. Answers are often found in more than one sentence. References and context can be found in surrounding sentences.",
    "Passage1:\n    Yet it’s the only way to explain what we’ve done to the night: we engineered it to meet our needs by filling it with light. (This is the last sentence in the passage1).\n  Passage2:\n              This kind of engineering is no different from damming a river. Its benefits come with consequences – called light pollution – whose effects scientists are only now beginning to study. Light pollution is largely the result of bad lighting design, which allows artificial light to shine outward and upward into the sky, where it is not wanted, instead of focusing it download, where it is. Wherever human light spills into the natural world, some aspect of life – migration, reproduction, feeding – is affected.\nPassage3:\n                  For most of human history, the phrase ‘light pollution’ would have made no sense. ( This the first sentence in the passage 3 ).\nQuestion: Most light pollution is caused by the direction of artificial lights rather than their intensity.\nAnswer: TRUE, but I wrote NOT GIVEN. Can you explain this?\nI found this question in Cambridge IELTS trainer material.",
    "The answer “TRUE” is correct. The intensity is all about the fact that night is flooded with light. This is explained in the previous paragraph. But the problems with light pollution are explained in the next paragraph and focus, not on intensity, but on direction – the light shines out and up. You are looking for one sentence in the passage which contains the information given in the question. This is not the way to approach TFNG. You need to read for meaning. The meaning of all those paragraphs is to show the intensity and then show that the main problem is the direction of light. I hope this helps you with your techniques and approach. Don’t try to match words – look for meaning in the sentences surrounding the key sentence in the passage.",
    "Hi Liz\nI just your video on Reading section Tips on TruE/ False / Not Given\nIt was lovely and very informative .\nThanks a lot. Really appreciate your efforts . Speaks immensely of how good a Human being you are!",
    "Would like to know the answer to the homework question towards the end of the video.\nPassage: By the second half of the 17th Century, coffee had found its way to Europe.\nQuestion: Coffee arrived in Europe after the 17th century",
    "The answer is on this page: https://ieltsliz.com/ielts-true-false-not-given-essential-tips/. I’m glad this page of lessons is helpful 🙂",
    "In exercise 2 it has been mentioned that “There is nothing magical or supernatural in the means by which they achieved their goals, as is commonly thought”\nBut in question no 5 it asked “Some people believed that magic may have been used by the Ancient Egyptians” Answered True. Why it should not be False?",
    "This is high level English which isn’t easy to understand. the words “as is commonly thought” presents the meaning of the whole sentence as: “it is common for people to think it is magical or supernatural, but there isn’t anything magical or supernatural in the means by which they ….” That is the translation in normal language. Only band 8 or 9 candidates are likely to get this one correct.",
    "Hi madam!",
    "I think you are the most effective personality in the field of IELTS Preparation!",
    "You know how much you are saving the money of the IELTS aspirants, uncountable, like I spent around $400 for IELTS preparation in academy but couldn’t find best techniques as I found in your videos just in few days. Even, today I mark the score 95% in the TFNG. I am very happy to see my score 95% in the practice test.",
    "I salute to your efforts.",
    "That’s great to know you are improving. Many schools and teachers are happy to take your money, but offer little effective training in return. That is the reason I made this website – for people who either don’t have the money or have already spent too much in their preparation. Keep learning and developing! Stay safe!",
    "True/False/ NG was the most challenging part of the exam for me ..Now I feel more confident about them",
    "Thanks a million for sharing all pieces of information freely",
    "I’m really glad you are feeling more confident now 🙂",
    "Hello madam,\nCan you help me with this?\nParagraph sentence:-\nFingerprinting offers an accurate and infallible means of personal identification. The ability to identify a person from a mere fingerprint is a powerful tool in the fight against crime. It is the most commonly used forensic evidence, often outperforming other methods of identification.",
    "Question:- Fingerprinting is the only effective method in identifying criminals.\nI wrote true owing to the last line saying outperforming other methods. But the correct answer given is false. Can you help me with the reason?",
    "It passage does not say “there are no other effective methods”. For the statement to be true, the passage much show there are NO other effective methods. There are other methods for identifying criminals, but fingerprinting is the most effective (not the only effective). You need to differentiate between “only” and “most”.",
    "hi liz\nit was a great lesson and practice. i really appreciate your work.\nthanks a lot",
    "Thanks a lot ma’am, for your philanthropy and goodwill gesture. I really appreciate your work and time given to us ( to the IELTSian :P).",
    "You’re welcome 🙂",
    "First of all, I have no words about you My Madam, My teacher, My honourable and Respectful BiG sister.\nReally Happy to see you. Actually i was used to see your videos on Youtube and i thought that you left the IElLS Coaching.\nBut i am so so so so happy.\nI have no words for you.\nJust simple is that “MAY GOD BLESS YOU”.\nYou are working for humanity 😊\nTake care.",
    "Thanks for your kind words. I stopped making videos for health reasons. But I do continue to publish short lessons on my website 🙂",
    "hi liz.",
    "get well soon\nI wish you happy and speed recover hop we will you soon in yotube",
    "Thanks.",
    "Thank u, madam, for your wonderful support. I wish you will be alright soon.",
    "get well soon mam:)\nyour website is useful to me.good job 🙂",
    "Hi Liz,\nThanks for every useful information you are sharing with us.\nI doubt reading question types with the given instructions :\n                  — No more than three words AND/OR a number\n                  — No more than two words AND/OR a number",
    "For Example, The below paragraph contains the answers for three questions:",
    "Staff permits are required to park a motor vehicle (other than a motorcycle parked in the cycle bays) on campus between 8:30 am to 4:30 pm, Monday to Friday, during term time. Annual permits can be purchased from the Hospitality Department. Application forms can be downloaded from the College website. All permits/tickets must be clearly displayed in the windscreen of vehicles during the dates for term time, as published in the academic calendar. Please inform the Services Administrator of any changes to registration details on telephone ext. 406. Annual car parking permits can be purchased from 20th September and are valid for one academic year from 1st October to 30th June. The annual charges for car parking are displayed on the application form.",
    "Choose NO MORE THAN THREE WORDS AND/OR A NUMBER from the text for each answer.",
    "1- Where you can buy parking permits at the college?\nMy Answer: The Hospitality Department\nCorrect Answer: Hospitality Department",
    "2- Which document shows the dates of term line?\nMy Answer: The Academic Calendar\nCorrect Answer: Academic Calendar",
    "3- What is the start date of annual parking permits?\nMy Answer: From 1st October\nCorrect Answer: 1st October",
    "Could you please help me with why my answers are incorrect though it is containing the relevant information?",
    "Many Thanks in advance!",
    "Short answer questions do not require articles or any other prepositions. The only time to consider articles is if you are completing a sentence which must be grammatically correct on completion.",
    "Good evening Liz.Thanks for all you do.I have a clarification on exercise 4,question number 4.According to the passage,the Chinese-mobile users received more than 300 billion SPAM texts in 2013.I don’t understand why NG was chosen as the answer. I think the answer here is FALSE .Please,kindly educate me more.Thanks.",
    "Did this figure increase or decrease? We know it was over 300 billion, but did it increase to reach 300 billion (which means it was previously lower) or did it decrease to reach 300 billion (which means it was previously higher)? Make sure you have fully (and I am 100%) analysed the meaning of the statement before you look at the passage information.",
    "Hi Liz ,\nYour videos and materials are very helpful .\nI have a question regarding Passage 3.\n(Beethoven).\nQuestion 5: Beethovens symphony 4 was inspired by a Successful person\nIn the passage , it says it was his original work and nothing like that was heard before  .",
    "So shouldn’t the answer be False ??",
    "The word “inspired” has no connection with the concept of it being “original”. Many people are inspired to write music by listening to water or the wind through trees or by a memory of someone they love or respect. This question really is testing your understanding of “inspired by”.",
    "Really helpful content. Liz’s guideline made an immediate impact on my performance in the Reading section.",
    "I’m really pleased thinks went well for you 🙂",
    "Thank you mam…. Almighty bless you",
    "Thank you Liz, I watched your Video on TFNG tips and tried few statements, got the answers right in first try. Thank you very much, all your lessons are informative and helpful.",
    "That’s great. I’m so pleased the lesson helped 🙂",
    "Great job. Thank you so much.",
    "Thank you so much Liz. Its been a great help for me. I was facing problems to distinguish between ” Not given” and “False”. After watching your video I have managed to get rid off that problem. Request you to share some Listening Tips as well.",
    "Use the RED MENU BAR at the top of the website to open the listening section of the site and learn more tips.",
    "hey Liz. If a statement has two points and one is correct, while the other is not mentioned in the essay, will it be false or not given?",
    "False means that the information in the statement is wrong according to the passage. NG means we do not know if it is wrong or right because not enough information is given in the passage. It is all about meaning.",
    "I’m grateful to you for saving our times by investing yours.",
    "Thanks 🙂 It’s my pleasure to help 🙂",
    "Hey Liz, Thanks for these useful IELTS preparation stuffs. It is very  much easy to understand and crack IELTS.",
    "Glad it was useful 🙂",
    "Thanks Liz. I love the way you make Ielts closer to everyone. My English is currently not very well, and I learn it myself. Your website helps me a lot. <3",
    "I’m very pleased that you can benefit from my site 🙂 Good luck with your learning 🙂",
    "Good Job, Madam Liz.\nKeep it up.",
    "This has been really helpful. Thanks so much for the strategy and practical advice. I am able to reduce my errors considerably because of all  your hard work.",
    "I’m glad the lessons are useful 🙂",
    "I am a native Arabic speaker and I struggled with Baalbek meaning :D:D:D:D",
    "you are amazing liz",
    "Hi Liz,",
    "I have a question about Cambridge  IELTS General training 14 reading test 3  section 1. Question related to true/false/not given\nPassage excerpt:\nDosoco recently awarded a grant to Alexia Sloane, a young composer with sight loss, to enable her to attend the sound-and-music summer-school composition course at the Purcell school.",
    "Question: Alexia Sloan lost her sight after attending a  summer school composition course",
    "Based on the passage information, its nowhere mentioned about how she lost her sight. So I answered this question as not given. However, the answer is false. Could you  please explain  this question to me.?",
    "You are trying to match words or look for specific words in the passage rather than understand the meaning. The passage shows that her sight was lost before she was given the grant for the summer course. The grant enabled a blind person to attend the course. So, you need to put in order which event happened first and how events are connected.\nI hope this helps.",
    "Thank you, Liz,  for the quick response and for explaining clearly.  Since a person can attend summer school many times and nothing, in particular, was mentioned related to the sight loss. I thought the answer was ‘not given’.  Perhaps, I was overthinking about the question rather than deriving it directly from the passage. It’s clear for me now 🙂",
    "Overthinking is really common in IELTS reading. It’s important to try to keep a logical approach 🙂",
    "Hello Liz,\nI love your teaching skills. Maam when is the right time to give the exam. Is it good to give exams after 1 month of preparation?",
    "You should take the test when your English is at a level that makes you feel confident and when you are really familiar with every aspect of the IELTS test. Take practice tests at home for listening and reading to check your scores. Or find an online teacher to assess your speaking or writing. Each person is different and they take a different amount of time to prepare.",
    "HI Liz,",
    "Just wanna say this is really good material. I just completed Part 2 and its really good. It enlightened me on how cocky the questions can get. Thanks for this :*",
    "Thank you very much LiZ  . can you give some reading  lesson",
    "You are really an awesome and amazing teacher with so much patience. I will be doing my reading, listening and writing test tomorrow. I pray with so much practice of your lessons, will help me a lot as it did on  my speaking test. Thanks once more",
    "There is a free practice test on the BC website – make sure you do at least one before your test. Good luck!! Glad your speaking test went well 🙂",
    "Thnxx a lot mam 😍😍",
    "Thanks so much Liz, I really appreciate. Please I need more of this to practice.",
    "Hi Liz,",
    "Your tutorial videos are easy to understand. Hats off to you for the good job.",
    "Your presentation method is what other tutors miss to convey. Just subscribed to your videos. I am biggest fan of your IELTS works.",
    "Dear Elizabeth,\nI had tried out so many other websites,  even had to create a new IG page just so that I could subscribe to IELTS lessons from other tutors yet I couldn’t seem to grab most of their points and felt really dumb till a friend sent me your link.",
    "I must confess, your tutorial tips are precise, your vidoes, simple, examples quite relatable and understandable and pratice questions concise.",
    "I truly appreciate your effortless service and dedication to this. Lots of love!",
    "I’m glad you find my lessons easy to follow 🙂",
    "Thank you so so much Liz you are a blessing to these generation . I now have a clear understanding by your teaching.",
    "Thank You Ms. Liz for putting these up inputs, you are doing a great job in the field of Education. God Bless you abundantly. Please keep up the good work.",
    "Respect from India.",
    "Hi Liz,",
    "I appreciate the time and efforts you put in your website to help students.",
    "Thanks a lot.",
    "Hello Liz! I just finished my exam and I think I messed up because in one part of the reading section, I didn’t follow the instructions. It said there to write the letter but I have written the full word. Will it be marked wrong? I feel so sad. By the way your site is extremely useful and thank you so much for your big help. Still waiting fo the result of my exam. God bless you!",
    "Unfortunately, if the answer is a letter and wrote a word, it will be marked wrong. It’s really important to follow instructions. Anyway, wait for your results – hopefully you will still get the result you need – finger crossed!!",
    "Hi Ms. Liz! thanks for the free lessons! I always struggle with T/F/NG or Y/N/NG  in the reading section so I was told to do lots of practice in answering these questions and I happened to visit your website. I find it very useful.",
    "I have some clarifications about one of your questions here. Like about Beethoven’s passage. in the question you provided, it says ” Beethoven’s Sypmphony No.3 was inspired by a famous man.” and the passage corresponding to it says ” Beethoven debuted his Symphony No. 3 in Napeleon’s honor.” The answer was NOT GIVEN but I answered it as TRUE. I thought it that way because he made it out of being inspired or he admires him, and “doing something out of someone else’s honor” also means “showing great respect and admiration to that person you whom you have devoted your work” (i looked it up in merriam webster’s dictionary so it’s a synonym which is indeed exactly the same in meaning). Please let me know if it is still not the case or am I wrong to think it that way.",
    "Thanks and More power to You!",
    "Your definition is correct:\n“doing something out of someone else’s honor” also means “showing great respect and admiration to that person you whom you have devoted your work”\nHowever, that has nothing to do with the original inspiration of the music. It means who he dedicated the final work to – not who or what created or triggered the initial feeling for the music. The inspiration could have come from listening to water or listening to trees – the inspiration is not given.\nPlease note that synonyms do NOT necessarily have 100% the same meaning. Also context is essential. You must NOT remove words from the context of the passage to compare them. The words are part of the context and you understand them through the context of the passage – this is what IELTS reading is all about. Otherwise, IELTS would have given you only lists of words to compare rather than interpretation of a passage. Do you see what I mean?",
    "Thanks for the explanation.",
    "You are the Best",
    "I had the same question as Rose because my answer was “True” as well but your explanation just addressed my concerns. Thank you Liz!",
    "I had the same question. Awesome explanation. Thanks Liz.",
    "I’m glad it helps 🙂",
    "This is really helpful 🙂",
    "Thank you Liz for all your efforts and tutorials. Can you please help me with the answer of this question?\n(True/False/Not Given)\nPARAGRAPH –    Set up a direct debit and your energy bill will be paid automatically each month( as long as you have sufficient funds in your chosen bank account).You qualify for a further 2% PromptPay discount if you choose this method.",
    "QUESTION – If you do not have enough money in your bank account when the direct debit is due,a penalty of 2% is added to your bill.",
    "Thanks in advance.",
    "You need to decide if the passage gives information about a penalty of 2% if there isn’t money in your account to pay the bill. True = you get the 2% penalty, FALSE = you do not get a 2% penalty, NG = it does give information about a 2% penalty for not having enough money in your account.",
    "It’s NG . As there are not any info given about  a 2% penalty .",
    "Exactly.",
    "Thank you for the tutorial. It’s of great help.",
    "By the second half of 17th century, coffee had found its way to Europe\nCoffee arrived in Europe after 17th century.\nI think the answer is false, isn’t it?",
    "Well done 🙂",
    "Hi Liz,",
    "You have great patience in providing useful tips and techniques (Patience for replying too..:))\nI see your video tutorials were insightful.\nYour classes are the best for proper IELTS preparation.",
    "I’m really glad you like my lessons 🙂",
    "Hi mam,\nThese lessons were really helpful.\nThanks",
    "For me, your IELTS practice tests, tips and lessons are understandable rather than others,\nThank you for doing this,",
    "BRILLIANT,",
    "I will share this to others as i can for you.",
    "I’m pleased you found the lesson useful 🙂 Thanks for sharing my site with others 🙂",
    "But the passage does say they received more than 300 billion in 2013 which does appear to me as contradictory to the statement that says it increased to reach 300 billion. So, to reach is not the same thing as more, from my understanding.",
    "Can you please throw more light? Thanks",
    "“increased to reach” indicates that previous years were less. Does the passage show increase or decrease? increase = true / decrease = false and no information about increasing or decreasing = NG. Always check the full meaning.",
    "I’m sure you can guess the answer by checking the following words “Set individual fee “.",
    "Liz,  thanks so much for creating this platform. I have been following up and i really love what you are doing for free. God in heaven will reword you.\nPlease can you help provide answer to this question??? i feel its true tho. i just want to be sure i’m not getting anythings wrong…",
    "Just put a hint up for you.",
    "Sure Liz. You are truly awesome. 🙂\nIt’s always easy to use Ctrl+F. I think students should be more diligent if they are really into learning and searching in the comments should be slightest of the effort.",
    "Hi Liz,\nHope you are doing well!\nI am confused with the question that Symphony No 3 was inspired by a famous man. I wrote the answer as True whereas it is actually Not Given.\nThe passage says that BEethoven debuted his symphony in Napoleon’s honour. Doesn’t that mean it was inspired by Napoleon ?\nPlease let me know why the answer to this is Not Given.",
    "Also, The question which says Romans learnt the technique from Ancient Egyptians. I thought it was true since the passage says that they used the same techniques as the Egyptians. Does that not coincide with the meaning that they learnt the techniques from them ?",
    "Thanks in advance.",
    "You need to find the difference between “doing something in someone’s honour” and “being inspired by someone”. Find the difference and you will get the answer. This is testing your understanding of those specific words.\nIf the question is about “learning” – does the passage explain about the origin of their knowledge?\nYou need to think more deeply about the meaning.",
    "hi Liz,\nthanks for your hard work.\nI am stuck on some question if you can help me, please\nPassage: if you are allocated a course and want to withdraw, you need to do so at least 2 weeks prior to the commencement date in order to avoid a fine. Depending upon the cost, of course, a late withdraw fine ranging from 10% to up to the half of the fees may be charged.",
    "Q. Withdrawing from a course one week before it starts may cost 50% of the course fees.",
    "As they did not mention about one week it must be not given but the real answer is True. how?",
    "Because any date less than two weeks gives a possible 50% fine. “a late withdrawal” means less than two weeks notice. I think you are confusing IELTS reading aims. Your aim is not to match word for word. Your aim is to understand the meaning and is if the meaning is found in the passage. The meaning in the passage is clear – less than two weeks notice is a fine ranging from 10% -50%. It is not necessary to mention, 1 day before, 2 days before, 3 days before, 4 days before, 5 days before, 6 days before, 1 week before, 8 days before etc etc – it says “a late withdrawal” which is considered anything less than 2 weeks. So, aim for meaning, not matching words.\nDoes this help???",
    "It helped me. And i also thought the answer is true.",
    "Thanks Liz, you are really making it easier to understand this particular Reading Question type, I hope the real exam is as simple as you make it seem.\nThank you again.",
    "MY lessons are to help you understand techniques, practice techniques, build awareness and build confidence. But you still need to be real tests at home. This means you need to do full tests at home both as practise and as mock exams (under exam conditions). Get the IELTS Cambridge test books for real tests.",
    "Liz, What you are doing here is awesome. You are an amazing teacher with lots of patience. Thank you for guiding.",
    "I’m glad you are finding my lessons useful 🙂",
    "Hi Liz,",
    "The tips and your materials are really helpful for me. I have a doubt in the first TFNG Exercise 1,\nPassage Says: People CAME from far and wide to see the first tunnel under a river.\nQuestion: People were DRAWN from all over to see the Thames tunnel.\nAnswer Given: TRUE",
    "In this case, as per my understanding, people visited the tunnel by their own interest(passage) but the question was people were PULLED from all over the world to see the tunnel then the answer should be FALSE right.",
    "Kindly clarify.",
    "You need to be careful with synonyms. No one word is 100% the same as another. Certainly drawn has a meaning of “pull”. But it also has other meanings. One  of those meanings is “attracted”. They came from all over to see something and they were attracted from all over to see something. In English, this is the same meaning. It certainly does not have an opposite meaning. And we can’t say that there is no information at all about this. It is definitely true.\nAvoid trying to match words. Paraphrasing will never be 100% the same – but the gist will be the same.",
    "hmmm clear enough. thanks",
    "Hi Liz,",
    "The passage mentions “people came from FAR and WIDE to see the first tunnel….” and the statement says “drawn from ALL over….”. “Far and wide” can be considered as a subset of “all”.\nI find it similar to the first example from the video “IELTS Reading tips: True False Not Given”, Time – 8:00, where “majority” didn’t represent “all” and the answer was marked False.",
    "Kindly request you to clarify.",
    "You need to understand the meaning of “all over” in English. It does not mean from every single country in existence on this planet. It means from many countries around the world. This means it is a phrase, not to be taken literally.",
    "here, drawn means forcing but in the passage mentioned as “people came” doesnt mean forcing so how come we can say it matches with the passage?",
    "In this passage, “drawn” means they were attracted and therefore they came. It doesn’t mean “forced” at all.",
    "Hi Liz\nI have found your blog very helpful, I have a confusion in second paragraph (Pyramid) Q no 7. The statement in paragraph says “Later the Romans would move huge stones, Some weighing near 1000 tons, Using similar techniques”.\nDoesn’t this statement show that Romans have learned from ancient Egyptians.",
    "It shows the techniques are similar. It does not say where they learnt them.",
    "Thanks a ton Liz.. I had the same question too.",
    "Also had the same question..the explanation makes sense though",
    "Thanks Liz,\n  I made the same mistake in that question",
    "Dear Mam,",
    "In Pyarid paragraph, Q no 1 states The wheel was invented during the pyramid age, even thought it was not used. ( NG), HOW?",
    "BUT IN PARAGRAPH,  The egyptians did not use the wheel during the pyramid age.",
    "Qno 5 states that  some people believed that magic may have been used by the ancient egyptians. (F) but the answer was given T how?",
    "But in paragraph\ntheir is nothing magical or supernatural in the means by which they achieved  their goals as, is commonly thought.   kindly explain it.",
    "Question 1 – is about inventing and the passage is about using\nQuestion 5 – “as is commonly thought” means that some people did believe it is magic.\nYou need to look more closely at the language used and have a deeper understanding of English “as is commonly thought”. If you didn’t understand the implication of that phrase in the sentence, you couldn’t get the right answer. This really is testing your understanding of English.",
    "You are a true influential person indeed",
    "Dear Mam,\nQ1: In passage, it is said,”The Egyptians did not use the wheel during the Pyramid Age, an invention that would have been of limited use on softer ground under heavy loads”. Doesn’t it mean that the wheel was invented before the Pyramid Age?",
    "It does not mean the wheel was invented before. We do not know when it was invented. It could have been invented in the early Pyramid Age, but wasn’t ever used.",
    "the keyword for q5 is “IS COMMONLY THOUGHT”",
    "Thank you Liz for the Confidence booster, I have a worry for Exercise 1 question 2,\nPeople were able to travel by sea OR land in those days. I think it’s false cos the means of transport was not indicated in the text.\nText said people come from Far and wide to see the first tunnel under a river. Any help will be appreciated",
    "“In the age of sail and horse-drawn coaches, people came long distances…”",
    "Hi Liz,",
    "I got a question from IELTS OG.\nIn the passage it says:  “Some of the most notable knighthoods of recent times have been bestowed on musicians or entertainers such as Sir Elton John and Sir Paul McCartney, and fields of finance, industry and education are also represented. ”   And in the question it says ” Most knights now come from the arts and entertainment industries”\nI thought it was False but the answer is NG.  I’m a bit confused about this. Would you mind explaining this to me?",
    "Thank you so much!",
    "The passage is about “some of the most notable” – which means some of the most well known – that is about notoriety. It does not indicate quantity. you have confused the word “most” with “most notable” – they are too very different things. The passage does not indicate anything about how many were given to musicians or entertainers – it only writes about the ones that were best remembered.",
    "WOW! Nice explantion",
    "Hi Liz, thank you for all the efforts you put in. I think the answer is NG, that the password was given(given password) did not necessarily mean that all employees were given same password.\n please i need further clarification on this, thanks a lot",
    "“your given password” indicates that each person is given a different password. If it was the same, it would be “the given password” without the pronoun. If you think not everyone was given the same password, it means the statement is incorrect which means FALSE. A NG answer means we do not know if they are given their own password or not because the passage does not provide information about it.",
    "Hi Liz,",
    "Reading from cambridge IELTS GT 11 book test 1",
    "Passage:\nIf you know or think that your child is having difficulties attending school you should contact the school. it is better to do this sooner rather than later.",
    "Question:\nStaff who think a child is having difficulties at school will contact parents.",
    "I have answered this as FALSE as the sentence contradicts the information. but the answer is NOT GIVEN.",
    "Could you please help me?",
    "The passage does not say what staff will do. Think more about the question before you look for your answer. Also the question is about “children having difficulties at school” – this means they are struggle with lessons or have problems with other children. But the passage has NO information about children having difficulties at school. The passage is only about problem attending school which means that the child might be absent and not attend.",
    "This means you confused the subject of the question “staff” of which there is no information in the passage and you confuse the issue “difficulties at school” which is also not given in the passage. Spend more time analysing the question – the key is the meaning and implication of the question.",
    "Thank you. Liz, you are really smart in handling IELTS lesson.",
    "ha ha ha\nYou are so good a teacher, IELTS  aspirant can easily be benefited. Thank you, Mis.",
    "Hi Liz, I refer to TFNG 3, Question 6. In the passage, the phrase “at the turn of the century” suggests that Beethoven’s struggle to follow a conversation was not until the 1900’s.  This is my outlook , meanwhile I would like that you correct my perception if I am wrong.",
    "So you believe he was born in about 1770 and didn’t turn deaf until about 1900. He turned deaf at the age of about 130? At this point, you need to use logical to determine which century the words “turn of the century” are applying to 🙂",
    "Wow. Now that should be included in your techniques for TFNG. I have the exact same question. Now that makes sense. Glad I was patient to scroll further down😅",
    "I’m glad I scrolled down to find this too.",
    "Thank you Liz for your pieces of advice 🙂",
    "Hi Liz,",
    "I was going through the “TFNG Exercise 3” and to me the answer for question 3 looks to be “Not Given” because he had to face the brutality for “Extra Practice” but not for his “Performance”. And as the statement doesn’t match so I feel it should be “Not Given”. Please correct me if I am wrong.",
    "False means that the passage shows the statement is wrong. Is it wrong? Is it correct? Or do we not know if it is wrong or right? I think we can see, that the statement, as you said, is incorrect – this means it is false. It is a false statement and the passage shows it is false.",
    "Hi Liz,",
    "But in the question, it said for poor performance. It seems that this was a reason, whereas in the passage, it said extra hours of practice, that is what he was forced to do, not a reason. I feel that the writer didn’t give us a reason for why he was deprived of sleep. So my answer is NG. Please correct me if I am wrong.",
    "Why did he lose sleep? Did he lose sleep because he had to do extra practice? Did he lose sleep because he was being punished for a bad performance? Or do we not know why he lost sleep?",
    "Oh, I see. Thank you!",
    "thank you liz for giving us very usefull website before.\ni feel little bit confusing about the word “All” in the TFNG, i found in Ielts cambridge 12 there is a sentence: “In Asia, there is a large degree of coconut diversity and evidence of millennia of human use- but there are no relatives growing in the wild”.\nthen, there is a statement: ” all the coconuts found in Asia are cultivated varieties.” the answer is T, can you explain me why it’s not false? because i think in the passage the word ” a large degree of coconut diversity” has different meaning with the word “All” in the passage. thankyou",
    "You are looking at the wrong part of the sentence “there are no relatives growing in the wild”. This means zero coconuts grow in the wild. What does that mean? It means ALL coconuts are cultivated. This is testing your understanding of “grow in the wild” and the word “cultivated”.",
    "woah, thank you liz for your great explanation",
    "Beautiful exlanation",
    "Hi Liz.\nI’m glad that I found you. Earlier I was going through many other websites and YouTube videos which later I found to be not useful. Now it’s been more than 15 days I’m following your website and videos. I’m preparing for general IELTS,and m a housewife also mother of 1 yr baby. So it’s truly helpful for me to learn from home through your website.",
    "Lots of love and blessings from India.",
    "Isn’t question 5 in exercise 3 True? He debuted his symphony in Napolean’s  honour…doesn’t that mean it was inspired by him?",
    "Look in the dictionary at the word “to be inspired by someone or something” and to “do something in someone’s honour”. When you are stuck in this way, it is due to your understanding of English – so – look in a dictionary.",
    "All original work is inspired by something. Please look up the word “inspired”.",
    "Even if you’re confused with the meaning of “inspired by” and “in honor of”, the statement in question 5 says the album was inspired by a famous man, which may not necessarily be Napoleon. No such information is given in the passage.",
    "Hi! Liz. First and foremost, I want to congratulate you for the SUCCESS of your WEBSITE. Why did I say that? It is because at first I ignore your website due to verbose content and was looking for more concise site. However, upon scanning your site I was surprised that IT IS NOT TRUE!!! The problem is ME not your site. I was being millennial who wants an INSTANT information.",
    "I have been using your website for 2 days now and I learn A LOT. Yes! A LOT!!!! 🙂 I become more motivated now than before. The given INFORMATION and TIPS are superb.",
    "THANK YOU SO MUCH!!!! Rest assured that I will recommend your informative website to my fellow IELTS friends.",
    "Thanks for your message. I think you made a good point. People seem to think there is one page of tips that will change their score and give them good results. This isn’t possible. It is only through deeper understanding and more practice that a person can develop and improve. It takes time and it takes some dedication. I’m glad you continued looking on my site 🙂",
    "there’s nothing magical as people believe (it means people often believed it was magical, you need to read the sentence to the end)",
    "Hie Liz.i am having problems in giving the answer as Not Given in the sense that the statement which would have been given seem to be false.pliz elaborate for me how i am to deliberate whether its NG or F",
    "FALSE means that the statement given is either opposite to the passage or that the passage shows it is wrong in one area.\nNG means we do not know if it is opposite or incorrect because no information is given to contradict it.",
    "Hello Liz,Real IELTS passages are longer, any techniques on handling those longer passages with few question’s",
    "Know which types of questions have answers that come in order. This will save you a lot of time as there is a logical progression of answers rather than jumping back and forth in the passage. Build speed reading skills. Focus on keywords – this is essential. Keywords are only useful if you combine that with paraphrasing. Many keywords will be paraphrased. You need a deep knowledge of paraphrases and the ability to spot words in a long passage. You can also learn which words are unlikely to be paraphrased – that makes finding the location of the answer quicker.",
    "Hi Liz\nThank you so much for the very useful guidance. Here I found a confusing Q&A\n about the Pyramid Building. It is Question number 7 that says: The Romans learned  the techniques of moving huge stones from the Ancient Egyptians. I chose the answer True for that because it says: More than 2000 years later, The Romans would move huge stones using similar techniques at Baalbek. It may be because of the word learned which have not used in the passage the answer is NG, however, somehow it was similar using method of moving stone. so it does not give the signal of, learning from Ancient Egyptians by Romans?",
    "Does the passage state where the Roman’s learned their technique? True = they learned from the Ancient Egyptians. False = they learned from someone else. NG = we do not know who they learned from because the passage does not say.",
    "Liz,  why do you think that is the wrong word to focus on?  I mean,  forgive me but,  it’s part of the sentence isn’t it?",
    "My comment means the person asking has ignored a vital word or words in the question. When I say they focus on the wrong word, it means they are looking in only one direction instead of looking at other words. Don’t ignore one thing for another.",
    "Hello Liz,\nI had the exact same query. Lucky to have found this. I too feel that when you state “…increased considerably to reach …”, it establishes a fundamental point of distinction. As in, one would never say its x has reached 300 from 400. You’d likely say it fell to 300 from 400. Hence, whether there is increase before it or not, one thing is sure that whatever the number was before it reached 300, it was less than 300. Whereas in the passage it clearly says ‘over’ 300. Wouldn’t you agree that’s a clear contradiction?\nI do understand your point about there being no mention of increase or decrease. But chronologically, the increase or decrease is rendered irrelevant once you realise the movement was still less than 300 before it ‘reached’ 300.\nthoughts?",
    "The statement relates to an increase. The passage gives NO information at all if the figure increased of decreased. The passage states “They received more than 300 billion of them in 2013”. This means the passage gives a fixed number in one given year. We do not know if this figure was higher or lower in the previous year. No information is given to show any change at all in the passage.\nYour task is to find the information in the passage and in this case we cannot find any such information in the passage to prove or disprove the statement.",
    "Speak Your Mind Cancel reply",
    "document.getElementById(\"comment\").setAttribute( \"id\", \"a2edd66308b9e854fb45ab4728e92858\" );document.getElementById(\"eaa43eedd2\").setAttribute( \"id\", \"comment\" );",
    "Name *",
    "Email *",
    "Website",
    "Notify me of follow-up comments by email.",
    "Notify me of new posts by email.",
    "",
    "ADVANCED IELTS LESSONS",
    "Recent Lessons",
    "New Reading Exercise for You (July 2024)",
    "IELTS GT Writing Task 1 Letter: Using the Prompts for a High Score",
    "IELTS Writing Task 1: Multiple Charts, Graphs and Tables",
    "IELTS Writing Task 2 Essay Topics 2024",
    "Introduction Paragraph for IELTS Writing Task 1",
    "About me",
    "<img alt='' src='https://secure.gravatar.com/avatar/a335fc6e564d91fa38f0b273e802ac83?s=45&#038;d=monsterid&#038;r=g' srcset='https://secure.gravatar.com/avatar/a335fc6e564d91fa38f0b273e802ac83?s=90&#038;d=monsterid&#038;r=g 2x' class='avatar avatar-45 photo' height='45' width='45' decoding='async'/>Hi, my name is Elizabeth (Liz). I am your teacher and the author of this website. I am an experienced, qualified English teacher specialising in IELTS test preparation since 2008. Please enjoy the 300 plus pages of free lessons, tips, model answers, topics etc.",
    "Click Below to Learn:",
    "Archives",
    "Copyright Notice",
    "Copyright © Elizabeth Ferguson, 2014 – 2024",
    "All rights reserved.",
    "Privacy Policy & Disclaimer",
    "Return to top of page",
    "Copyright © 2024 · Prose on Genesis Framework · WordPress · Log in"
  ]
}